espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** TWAIFD_DEVICE_ID_REG register
 *  TWAI FD device id status register
 */
#define TWAIFD_DEVICE_ID_REG (DR_REG_TWAIFD_BASE + 0x0)
/** TWAIFD_DEVICE_ID : R/W; bitpos: [31:0]; default: 51965;
 *  Represents whether CAN IP function is mapped correctly on its base address.
 */
#define TWAIFD_DEVICE_ID    0xFFFFFFFFU
#define TWAIFD_DEVICE_ID_M  (TWAIFD_DEVICE_ID_V << TWAIFD_DEVICE_ID_S)
#define TWAIFD_DEVICE_ID_V  0xFFFFFFFFU
#define TWAIFD_DEVICE_ID_S  0

/** TWAIFD_MODE_SETTING_REG register
 *  TWAI FD mode setting register
 */
#define TWAIFD_MODE_SETTING_REG (DR_REG_TWAIFD_BASE + 0x4)
/** TWAIFD_SW_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to reset the TWAI FD controller.\\
 *  0: invalid\\
 *  1: reset.\\
 */
#define TWAIFD_SW_RESET    (BIT(0))
#define TWAIFD_SW_RESET_M  (TWAIFD_SW_RESET_V << TWAIFD_SW_RESET_S)
#define TWAIFD_SW_RESET_V  0x00000001U
#define TWAIFD_SW_RESET_S  0
/** TWAIFD_LISTEN_ONLY_MODE : R/W; bitpos: [1]; default: 0;
 *  bus monitor enable
 */
#define TWAIFD_LISTEN_ONLY_MODE    (BIT(1))
#define TWAIFD_LISTEN_ONLY_MODE_M  (TWAIFD_LISTEN_ONLY_MODE_V << TWAIFD_LISTEN_ONLY_MODE_S)
#define TWAIFD_LISTEN_ONLY_MODE_V  0x00000001U
#define TWAIFD_LISTEN_ONLY_MODE_S  1
/** TWAIFD_SELF_TEST_MODE : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable the self test mode.\\
 *  0: disable\\
 *  1: enable\\
 */
#define TWAIFD_SELF_TEST_MODE    (BIT(2))
#define TWAIFD_SELF_TEST_MODE_M  (TWAIFD_SELF_TEST_MODE_V << TWAIFD_SELF_TEST_MODE_S)
#define TWAIFD_SELF_TEST_MODE_V  0x00000001U
#define TWAIFD_SELF_TEST_MODE_S  2
/** TWAIFD_ACCEPT_FILTER_MODE : R/W; bitpos: [3]; default: 0;
 *  Configures whether or not to enable the usage of acceptance filters.\\
 *  0: disable\\
 *  1: enable\\
 */
#define TWAIFD_ACCEPT_FILTER_MODE    (BIT(3))
#define TWAIFD_ACCEPT_FILTER_MODE_M  (TWAIFD_ACCEPT_FILTER_MODE_V << TWAIFD_ACCEPT_FILTER_MODE_S)
#define TWAIFD_ACCEPT_FILTER_MODE_V  0x00000001U
#define TWAIFD_ACCEPT_FILTER_MODE_S  3
/** TWAIFD_FLEXIBLE_DATA_RATE : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to support flexible data rate.\\
 *  0: not support\\
 *  1: support\\
 */
#define TWAIFD_FLEXIBLE_DATA_RATE    (BIT(4))
#define TWAIFD_FLEXIBLE_DATA_RATE_M  (TWAIFD_FLEXIBLE_DATA_RATE_V << TWAIFD_FLEXIBLE_DATA_RATE_S)
#define TWAIFD_FLEXIBLE_DATA_RATE_V  0x00000001U
#define TWAIFD_FLEXIBLE_DATA_RATE_S  4
/** TWAIFD_RTR_FRM_BEHAVIOR : R/W; bitpos: [5]; default: 0;
 *  time_triggered transmission mode
 */
#define TWAIFD_RTR_FRM_BEHAVIOR    (BIT(5))
#define TWAIFD_RTR_FRM_BEHAVIOR_M  (TWAIFD_RTR_FRM_BEHAVIOR_V << TWAIFD_RTR_FRM_BEHAVIOR_S)
#define TWAIFD_RTR_FRM_BEHAVIOR_V  0x00000001U
#define TWAIFD_RTR_FRM_BEHAVIOR_S  5
/** TWAIFD_ROM : R/W; bitpos: [6]; default: 0;
 *  a\\
 */
#define TWAIFD_ROM    (BIT(6))
#define TWAIFD_ROM_M  (TWAIFD_ROM_V << TWAIFD_ROM_S)
#define TWAIFD_ROM_V  0x00000001U
#define TWAIFD_ROM_S  6
/** TWAIFD_ACK_BEHAVIOR : R/W; bitpos: [7]; default: 0;
 *  Configures the acknowledge behavior.\\
 *  0: normal behavior.\\
 *  1: acknowledge is not sent.\\
 */
#define TWAIFD_ACK_BEHAVIOR    (BIT(7))
#define TWAIFD_ACK_BEHAVIOR_M  (TWAIFD_ACK_BEHAVIOR_V << TWAIFD_ACK_BEHAVIOR_S)
#define TWAIFD_ACK_BEHAVIOR_V  0x00000001U
#define TWAIFD_ACK_BEHAVIOR_S  7
/** TWAIFD_TEST_MODE : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to enable the triple sampling mode.\\
 *  0: disable\\
 *  1: enable\\
 */
#define TWAIFD_TEST_MODE    (BIT(8))
#define TWAIFD_TEST_MODE_M  (TWAIFD_TEST_MODE_V << TWAIFD_TEST_MODE_S)
#define TWAIFD_TEST_MODE_V  0x00000001U
#define TWAIFD_TEST_MODE_S  8
/** TWAIFD_RXBAM : R/W; bitpos: [9]; default: 1;
 *  a\\
 */
#define TWAIFD_RXBAM    (BIT(9))
#define TWAIFD_RXBAM_M  (TWAIFD_RXBAM_V << TWAIFD_RXBAM_S)
#define TWAIFD_RXBAM_V  0x00000001U
#define TWAIFD_RXBAM_S  9
/** TWAIFD_LIMIT_RETX_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether or not to enable the limit of retransmission.\\
 *  0: disable\\
 *  1: enable\\
 */
#define TWAIFD_LIMIT_RETX_EN    (BIT(16))
#define TWAIFD_LIMIT_RETX_EN_M  (TWAIFD_LIMIT_RETX_EN_V << TWAIFD_LIMIT_RETX_EN_S)
#define TWAIFD_LIMIT_RETX_EN_V  0x00000001U
#define TWAIFD_LIMIT_RETX_EN_S  16
/** TWAIFD_RETX_THRES : R/W; bitpos: [20:17]; default: 0;
 *  Configures the threshold of retransmission attempts. \\
 */
#define TWAIFD_RETX_THRES    0x0000000FU
#define TWAIFD_RETX_THRES_M  (TWAIFD_RETX_THRES_V << TWAIFD_RETX_THRES_S)
#define TWAIFD_RETX_THRES_V  0x0000000FU
#define TWAIFD_RETX_THRES_S  17
/** TWAIFD_ILBP : R/W; bitpos: [21]; default: 0;
 *  acknowledge forbidden mode
 */
#define TWAIFD_ILBP    (BIT(21))
#define TWAIFD_ILBP_M  (TWAIFD_ILBP_V << TWAIFD_ILBP_S)
#define TWAIFD_ILBP_V  0x00000001U
#define TWAIFD_ILBP_S  21
/** TWAIFD_CTRL_EN : R/W; bitpos: [22]; default: 0;
 *  Configures whether or not to enable the twai FD controller.\\
 *  0: disable\\
 *  1: enable\\
 */
#define TWAIFD_CTRL_EN    (BIT(22))
#define TWAIFD_CTRL_EN_M  (TWAIFD_CTRL_EN_V << TWAIFD_CTRL_EN_S)
#define TWAIFD_CTRL_EN_V  0x00000001U
#define TWAIFD_CTRL_EN_S  22
/** TWAIFD_FD_TYPE : R/W; bitpos: [23]; default: 0;
 *  Configure the twai fd frame type.\\
 *  0: ISO CAN FD\\
 *  1: CAN FD 1.0\\
 */
#define TWAIFD_FD_TYPE    (BIT(23))
#define TWAIFD_FD_TYPE_M  (TWAIFD_FD_TYPE_V << TWAIFD_FD_TYPE_S)
#define TWAIFD_FD_TYPE_V  0x00000001U
#define TWAIFD_FD_TYPE_S  23
/** TWAIFD_PEX : R/W; bitpos: [24]; default: 0;
 *  protocol expection mode\\
 */
#define TWAIFD_PEX    (BIT(24))
#define TWAIFD_PEX_M  (TWAIFD_PEX_V << TWAIFD_PEX_S)
#define TWAIFD_PEX_V  0x00000001U
#define TWAIFD_PEX_S  24
/** TWAIFD_TBFBO : R/W; bitpos: [25]; default: 1;
 *  a\\
 */
#define TWAIFD_TBFBO    (BIT(25))
#define TWAIFD_TBFBO_M  (TWAIFD_TBFBO_V << TWAIFD_TBFBO_S)
#define TWAIFD_TBFBO_V  0x00000001U
#define TWAIFD_TBFBO_S  25
/** TWAIFD_FDRF : R/W; bitpos: [26]; default: 0;
 *  a\\
 */
#define TWAIFD_FDRF    (BIT(26))
#define TWAIFD_FDRF_M  (TWAIFD_FDRF_V << TWAIFD_FDRF_S)
#define TWAIFD_FDRF_V  0x00000001U
#define TWAIFD_FDRF_S  26

