espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/** TWAIFD_COMMAND_REG register
 *  TWAI FD command register
 */
#define TWAIFD_COMMAND_REG (DR_REG_TWAIFD_BASE + 0x8)
/** TWAIFD_RXRPMV : WO; bitpos: [1]; default: 0;
 *  a\\
 */
#define TWAIFD_RXRPMV    (BIT(1))
#define TWAIFD_RXRPMV_M  (TWAIFD_RXRPMV_V << TWAIFD_RXRPMV_S)
#define TWAIFD_RXRPMV_V  0x00000001U
#define TWAIFD_RXRPMV_S  1
/** TWAIFD_RELEASE_RX_BUF : WO; bitpos: [2]; default: 0;
 *  Configures whether or not to delete all data from the receive buffer.\\
 *  0: invalid\\
 *  1: delete\\
 */
#define TWAIFD_RELEASE_RX_BUF    (BIT(2))
#define TWAIFD_RELEASE_RX_BUF_M  (TWAIFD_RELEASE_RX_BUF_V << TWAIFD_RELEASE_RX_BUF_S)
#define TWAIFD_RELEASE_RX_BUF_V  0x00000001U
#define TWAIFD_RELEASE_RX_BUF_S  2
/** TWAIFD_CLR_OVERRUN_FLG : WO; bitpos: [3]; default: 0;
 *  Configures whether or not to clear the data overrun flag.\\
 *  0: invalid\\
 *  1: clear\\
 */
#define TWAIFD_CLR_OVERRUN_FLG    (BIT(3))
#define TWAIFD_CLR_OVERRUN_FLG_M  (TWAIFD_CLR_OVERRUN_FLG_V << TWAIFD_CLR_OVERRUN_FLG_S)
#define TWAIFD_CLR_OVERRUN_FLG_V  0x00000001U
#define TWAIFD_CLR_OVERRUN_FLG_S  3
/** TWAIFD_ERCRST : WO; bitpos: [4]; default: 0;
 *  a\\
 */
#define TWAIFD_ERCRST    (BIT(4))
#define TWAIFD_ERCRST_M  (TWAIFD_ERCRST_V << TWAIFD_ERCRST_S)
#define TWAIFD_ERCRST_V  0x00000001U
#define TWAIFD_ERCRST_S  4
/** TWAIFD_RXFCRST : WO; bitpos: [5]; default: 0;
 *  a\\
 */
#define TWAIFD_RXFCRST    (BIT(5))
#define TWAIFD_RXFCRST_M  (TWAIFD_RXFCRST_V << TWAIFD_RXFCRST_S)
#define TWAIFD_RXFCRST_V  0x00000001U
#define TWAIFD_RXFCRST_S  5
/** TWAIFD_TXFCRST : WO; bitpos: [6]; default: 0;
 *  a\\
 */
#define TWAIFD_TXFCRST    (BIT(6))
#define TWAIFD_TXFCRST_M  (TWAIFD_TXFCRST_V << TWAIFD_TXFCRST_S)
#define TWAIFD_TXFCRST_V  0x00000001U
#define TWAIFD_TXFCRST_S  6
/** TWAIFD_CPEXS : WO; bitpos: [7]; default: 0;
 *  a\\
 */
#define TWAIFD_CPEXS    (BIT(7))
#define TWAIFD_CPEXS_M  (TWAIFD_CPEXS_V << TWAIFD_CPEXS_S)
#define TWAIFD_CPEXS_V  0x00000001U
#define TWAIFD_CPEXS_S  7

/** TWAIFD_STATUS_REG register
 *  TWAI FD status register
 */
#define TWAIFD_STATUS_REG (DR_REG_TWAIFD_BASE + 0xc)
/** TWAIFD_RX_BUF_STAT : RO; bitpos: [0]; default: 0;
 *  Represents whether or not the receive buffer is empty.\\
 *  0: empty\\
 *  1: not empty\\
 */
#define TWAIFD_RX_BUF_STAT    (BIT(0))
#define TWAIFD_RX_BUF_STAT_M  (TWAIFD_RX_BUF_STAT_V << TWAIFD_RX_BUF_STAT_S)
#define TWAIFD_RX_BUF_STAT_V  0x00000001U
#define TWAIFD_RX_BUF_STAT_S  0
/** TWAIFD_DATA_OVERRUN_FLG : RO; bitpos: [1]; default: 0;
 *  Represents whether or not the receive buffer is full and the frame is
 *  overrun(lost).\\
 *  0: not overrun\\
 *  1: overrun\\
 */
#define TWAIFD_DATA_OVERRUN_FLG    (BIT(1))
#define TWAIFD_DATA_OVERRUN_FLG_M  (TWAIFD_DATA_OVERRUN_FLG_V << TWAIFD_DATA_OVERRUN_FLG_S)
#define TWAIFD_DATA_OVERRUN_FLG_V  0x00000001U
#define TWAIFD_DATA_OVERRUN_FLG_S  1
/** TWAIFD_TX_BUF_SAT : RO; bitpos: [2]; default: 0;
 *  Represents whether or not the transmit buffer is full.\\
 *  0: not full\\
 *  1: full\\
 */
#define TWAIFD_TX_BUF_SAT    (BIT(2))
#define TWAIFD_TX_BUF_SAT_M  (TWAIFD_TX_BUF_SAT_V << TWAIFD_TX_BUF_SAT_S)
#define TWAIFD_TX_BUF_SAT_V  0x00000001U
#define TWAIFD_TX_BUF_SAT_S  2
/** TWAIFD_ERR_FRM_TX : RO; bitpos: [3]; default: 0;
 *  Represents whether or not the error frame is being transmitted.\\
 *  0: not being transmitted\\
 *  1: being transmitted\\
 */
#define TWAIFD_ERR_FRM_TX    (BIT(3))
#define TWAIFD_ERR_FRM_TX_M  (TWAIFD_ERR_FRM_TX_V << TWAIFD_ERR_FRM_TX_S)
#define TWAIFD_ERR_FRM_TX_V  0x00000001U
#define TWAIFD_ERR_FRM_TX_S  3
/** TWAIFD_RX_FRM_STAT : RO; bitpos: [4]; default: 0;
 *  Represents whether or not the controller is receiving a frame.\\
 *  0: not receiving\\
 *  1: receiving\\
 */
#define TWAIFD_RX_FRM_STAT    (BIT(4))
#define TWAIFD_RX_FRM_STAT_M  (TWAIFD_RX_FRM_STAT_V << TWAIFD_RX_FRM_STAT_S)
#define TWAIFD_RX_FRM_STAT_V  0x00000001U
#define TWAIFD_RX_FRM_STAT_S  4
/** TWAIFD_TX_FRM_STAT : RO; bitpos: [5]; default: 0;
 *  Represents whether or not the controller is transmitting a frame.\\
 *  0: not transmitting\\
 *  1: transmitting\\
 */
#define TWAIFD_TX_FRM_STAT    (BIT(5))
#define TWAIFD_TX_FRM_STAT_M  (TWAIFD_TX_FRM_STAT_V << TWAIFD_TX_FRM_STAT_S)
#define TWAIFD_TX_FRM_STAT_V  0x00000001U
#define TWAIFD_TX_FRM_STAT_S  5
/** TWAIFD_ERR_STAT : RO; bitpos: [6]; default: 0;
 *  Represents whether or not the error warning limit is reached.\\
 *  0: not reached\\
 *  1: reached\\
 */
#define TWAIFD_ERR_STAT    (BIT(6))
#define TWAIFD_ERR_STAT_M  (TWAIFD_ERR_STAT_V << TWAIFD_ERR_STAT_S)
#define TWAIFD_ERR_STAT_V  0x00000001U
#define TWAIFD_ERR_STAT_S  6
/** TWAIFD_BUS_STAT : RO; bitpos: [7]; default: 1;
 *  Represents whether or not bus is active.\\
 *  0: active\\
 *  1: not active\\
 */
#define TWAIFD_BUS_STAT    (BIT(7))
#define TWAIFD_BUS_STAT_M  (TWAIFD_BUS_STAT_V << TWAIFD_BUS_STAT_S)
#define TWAIFD_BUS_STAT_V  0x00000001U
#define TWAIFD_BUS_STAT_S  7
/** TWAIFD_PEXS : RO; bitpos: [8]; default: 0;
 *  a\\
 */
#define TWAIFD_PEXS    (BIT(8))
#define TWAIFD_PEXS_M  (TWAIFD_PEXS_V << TWAIFD_PEXS_S)
#define TWAIFD_PEXS_V  0x00000001U
#define TWAIFD_PEXS_S  8
/** TWAIFD_REINTEGRATING_WAIT : RO; bitpos: [9]; default: 0;
 *  fsm is in reintegrating wait status
 */
#define TWAIFD_REINTEGRATING_WAIT    (BIT(9))
#define TWAIFD_REINTEGRATING_WAIT_M  (TWAIFD_REINTEGRATING_WAIT_V << TWAIFD_REINTEGRATING_WAIT_S)
#define TWAIFD_REINTEGRATING_WAIT_V  0x00000001U
#define TWAIFD_REINTEGRATING_WAIT_S  9
/** TWAIFD_STCNT : RO; bitpos: [16]; default: 0;
 *  a\\
 */
#define TWAIFD_STCNT    (BIT(16))
#define TWAIFD_STCNT_M  (TWAIFD_STCNT_V << TWAIFD_STCNT_S)
#define TWAIFD_STCNT_V  0x00000001U
#define TWAIFD_STCNT_S  16
/** TWAIFD_STRGS : RO; bitpos: [17]; default: 0;
 *  a\\
 */
#define TWAIFD_STRGS    (BIT(17))
#define TWAIFD_STRGS_M  (TWAIFD_STRGS_V << TWAIFD_STRGS_S)
#define TWAIFD_STRGS_V  0x00000001U
#define TWAIFD_STRGS_S  17

/** TWAIFD_INT_RAW_REG register
 *  TWAI FD interrupt raw register
 */
#define TWAIFD_INT_RAW_REG (DR_REG_TWAIFD_BASE + 0x10)
/** TWAIFD_RX_FRM_SUC_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt status of TWAIFD_RX_FRM_SUC_INT.
 */
#define TWAIFD_RX_FRM_SUC_INT_RAW    (BIT(0))
#define TWAIFD_RX_FRM_SUC_INT_RAW_M  (TWAIFD_RX_FRM_SUC_INT_RAW_V << TWAIFD_RX_FRM_SUC_INT_RAW_S)
#define TWAIFD_RX_FRM_SUC_INT_RAW_V  0x00000001U
#define TWAIFD_RX_FRM_SUC_INT_RAW_S  0
/** TWAIFD_TX_FRM_SUC_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt status of TWAIFD_TX_FRM_SUC_INT.
 */
#define TWAIFD_TX_FRM_SUC_INT_RAW    (BIT(1))
#define TWAIFD_TX_FRM_SUC_INT_RAW_M  (TWAIFD_TX_FRM_SUC_INT_RAW_V << TWAIFD_TX_FRM_SUC_INT_RAW_S)
#define TWAIFD_TX_FRM_SUC_INT_RAW_V  0x00000001U
#define TWAIFD_TX_FRM_SUC_INT_RAW_S  1
/** TWAIFD_ERR_WARNING_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt status of TWAIFD_ERR_WARNING_INT.
 */
#define TWAIFD_ERR_WARNING_INT_RAW    (BIT(2))
#define TWAIFD_ERR_WARNING_INT_RAW_M  (TWAIFD_ERR_WARNING_INT_RAW_V << TWAIFD_ERR_WARNING_INT_RAW_S)
#define TWAIFD_ERR_WARNING_INT_RAW_V  0x00000001U
#define TWAIFD_ERR_WARNING_INT_RAW_S  2
/** TWAIFD_RX_DATA_OVERRUN_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt status of TWAIFD_RX_DATA_OVERRUN_INT.
 */
#define TWAIFD_RX_DATA_OVERRUN_INT_RAW    (BIT(3))
#define TWAIFD_RX_DATA_OVERRUN_INT_RAW_M  (TWAIFD_RX_DATA_OVERRUN_INT_RAW_V << TWAIFD_RX_DATA_OVERRUN_INT_RAW_S)
#define TWAIFD_RX_DATA_OVERRUN_INT_RAW_V  0x00000001U
#define TWAIFD_RX_DATA_OVERRUN_INT_RAW_S  3
/** TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt status of TWAIFD_FAULT_CONFINEMENT_CHG_INT.
 */
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW    (BIT(5))
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW_M  (TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW_V << TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW_S)
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW_V  0x00000001U
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_RAW_S  5
/** TWAIFD_ARB_LOST_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt status of TWAIFD_ARB_LOST_INT.
 */
#define TWAIFD_ARB_LOST_INT_RAW    (BIT(6))
#define TWAIFD_ARB_LOST_INT_RAW_M  (TWAIFD_ARB_LOST_INT_RAW_V << TWAIFD_ARB_LOST_INT_RAW_S)
#define TWAIFD_ARB_LOST_INT_RAW_V  0x00000001U
#define TWAIFD_ARB_LOST_INT_RAW_S  6
/** TWAIFD_ERR_DETECTED_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt status of TWAIFD_ERR_DETECTED_INT.
 */
#define TWAIFD_ERR_DETECTED_INT_RAW    (BIT(7))
#define TWAIFD_ERR_DETECTED_INT_RAW_M  (TWAIFD_ERR_DETECTED_INT_RAW_V << TWAIFD_ERR_DETECTED_INT_RAW_S)
#define TWAIFD_ERR_DETECTED_INT_RAW_V  0x00000001U
#define TWAIFD_ERR_DETECTED_INT_RAW_S  7
/** TWAIFD_IS_OVERLOAD_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt status of TWAIFD_IS_OVERLOAD_INT.
 */
#define TWAIFD_IS_OVERLOAD_INT_RAW    (BIT(8))
#define TWAIFD_IS_OVERLOAD_INT_RAW_M  (TWAIFD_IS_OVERLOAD_INT_RAW_V << TWAIFD_IS_OVERLOAD_INT_RAW_S)
#define TWAIFD_IS_OVERLOAD_INT_RAW_V  0x00000001U
#define TWAIFD_IS_OVERLOAD_INT_RAW_S  8
/** TWAIFD_RX_BUF_FULL_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt status of TWAIFD_RX_BUF_FULL_INT.
 */
#define TWAIFD_RX_BUF_FULL_INT_RAW    (BIT(9))
#define TWAIFD_RX_BUF_FULL_INT_RAW_M  (TWAIFD_RX_BUF_FULL_INT_RAW_V << TWAIFD_RX_BUF_FULL_INT_RAW_S)
#define TWAIFD_RX_BUF_FULL_INT_RAW_V  0x00000001U
#define TWAIFD_RX_BUF_FULL_INT_RAW_S  9
/** TWAIFD_BIT_RATE_SHIFT_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt status of TWAIFD_BIT_RATE_SHIFT_INT.
 */
#define TWAIFD_BIT_RATE_SHIFT_INT_RAW    (BIT(10))
#define TWAIFD_BIT_RATE_SHIFT_INT_RAW_M  (TWAIFD_BIT_RATE_SHIFT_INT_RAW_V << TWAIFD_BIT_RATE_SHIFT_INT_RAW_S)
#define TWAIFD_BIT_RATE_SHIFT_INT_RAW_V  0x00000001U
#define TWAIFD_BIT_RATE_SHIFT_INT_RAW_S  10
/** TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt status of TWAIFD_RX_BUF_NOT_EMPTY_INT.
 */
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW    (BIT(11))
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW_M  (TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW_V << TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW_S)
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW_V  0x00000001U
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_RAW_S  11
/** TWAIFD_TX_BUF_STATUS_CHG_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt status of TWAIFD_TX_BUF_STATUS_CHG_INT.
 */
#define TWAIFD_TX_BUF_STATUS_CHG_INT_RAW    (BIT(12))
#define TWAIFD_TX_BUF_STATUS_CHG_INT_RAW_M  (TWAIFD_TX_BUF_STATUS_CHG_INT_RAW_V << TWAIFD_TX_BUF_STATUS_CHG_INT_RAW_S)
#define TWAIFD_TX_BUF_STATUS_CHG_INT_RAW_V  0x00000001U
#define TWAIFD_TX_BUF_STATUS_CHG_INT_RAW_S  12

/** TWAIFD_INT_ENA_REG register
 *  TWAI FD interrupt enable register
 */
#define TWAIFD_INT_ENA_REG (DR_REG_TWAIFD_BASE + 0x14)
/** TWAIFD_RX_FRM_SUC_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable TWAIFD_RX_FRM_SUC_INT.
 */
#define TWAIFD_RX_FRM_SUC_INT_ENA    (BIT(0))
#define TWAIFD_RX_FRM_SUC_INT_ENA_M  (TWAIFD_RX_FRM_SUC_INT_ENA_V << TWAIFD_RX_FRM_SUC_INT_ENA_S)
#define TWAIFD_RX_FRM_SUC_INT_ENA_V  0x00000001U
#define TWAIFD_RX_FRM_SUC_INT_ENA_S  0
/** TWAIFD_TX_FRM_SUC_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable TWAIFD_TX_FRM_SUC_INT.
 */
#define TWAIFD_TX_FRM_SUC_INT_ENA    (BIT(1))
#define TWAIFD_TX_FRM_SUC_INT_ENA_M  (TWAIFD_TX_FRM_SUC_INT_ENA_V << TWAIFD_TX_FRM_SUC_INT_ENA_S)
#define TWAIFD_TX_FRM_SUC_INT_ENA_V  0x00000001U
#define TWAIFD_TX_FRM_SUC_INT_ENA_S  1
/** TWAIFD_ERR_WARNING_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable TWAIFD_ERR_WARNING_INT.
 */
#define TWAIFD_ERR_WARNING_INT_ENA    (BIT(2))
#define TWAIFD_ERR_WARNING_INT_ENA_M  (TWAIFD_ERR_WARNING_INT_ENA_V << TWAIFD_ERR_WARNING_INT_ENA_S)
#define TWAIFD_ERR_WARNING_INT_ENA_V  0x00000001U
#define TWAIFD_ERR_WARNING_INT_ENA_S  2
/** TWAIFD_RX_DATA_OVERRUN_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable TWAIFD_RX_DATA_OVERRUN_INT.
 */
#define TWAIFD_RX_DATA_OVERRUN_INT_ENA    (BIT(3))
#define TWAIFD_RX_DATA_OVERRUN_INT_ENA_M  (TWAIFD_RX_DATA_OVERRUN_INT_ENA_V << TWAIFD_RX_DATA_OVERRUN_INT_ENA_S)
#define TWAIFD_RX_DATA_OVERRUN_INT_ENA_V  0x00000001U
#define TWAIFD_RX_DATA_OVERRUN_INT_ENA_S  3
/** TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable TWAIFD_FAULT_CONFINEMENT_CHG_INT.
 */
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA    (BIT(5))
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA_M  (TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA_V << TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA_S)
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA_V  0x00000001U
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ENA_S  5
/** TWAIFD_ARB_LOST_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable TWAIFD_ARB_LOST_INT.
 */
#define TWAIFD_ARB_LOST_INT_ENA    (BIT(6))
#define TWAIFD_ARB_LOST_INT_ENA_M  (TWAIFD_ARB_LOST_INT_ENA_V << TWAIFD_ARB_LOST_INT_ENA_S)
#define TWAIFD_ARB_LOST_INT_ENA_V  0x00000001U
#define TWAIFD_ARB_LOST_INT_ENA_S  6
/** TWAIFD_ERR_DETECTED_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Write 1 to enable TWAIFD_ERR_DETECTED_INT.
 */
#define TWAIFD_ERR_DETECTED_INT_ENA    (BIT(7))
#define TWAIFD_ERR_DETECTED_INT_ENA_M  (TWAIFD_ERR_DETECTED_INT_ENA_V << TWAIFD_ERR_DETECTED_INT_ENA_S)
#define TWAIFD_ERR_DETECTED_INT_ENA_V  0x00000001U
#define TWAIFD_ERR_DETECTED_INT_ENA_S  7
/** TWAIFD_IS_OVERLOAD_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  Write 1 to enable TWAIFD_IS_OVERLOAD_INT.
 */
#define TWAIFD_IS_OVERLOAD_INT_ENA    (BIT(8))
#define TWAIFD_IS_OVERLOAD_INT_ENA_M  (TWAIFD_IS_OVERLOAD_INT_ENA_V << TWAIFD_IS_OVERLOAD_INT_ENA_S)
#define TWAIFD_IS_OVERLOAD_INT_ENA_V  0x00000001U
#define TWAIFD_IS_OVERLOAD_INT_ENA_S  8
/** TWAIFD_RX_BUF_FULL_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  Write 1 to enable TWAIFD_RX_BUF_FULL_INT.
 */
#define TWAIFD_RX_BUF_FULL_INT_ENA    (BIT(9))
#define TWAIFD_RX_BUF_FULL_INT_ENA_M  (TWAIFD_RX_BUF_FULL_INT_ENA_V << TWAIFD_RX_BUF_FULL_INT_ENA_S)
#define TWAIFD_RX_BUF_FULL_INT_ENA_V  0x00000001U
#define TWAIFD_RX_BUF_FULL_INT_ENA_S  9
/** TWAIFD_BIT_RATE_SHIFT_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  Write 1 to enable TWAIFD_BIT_RATE_SHIFT_INT.
 */
#define TWAIFD_BIT_RATE_SHIFT_INT_ENA    (BIT(10))
#define TWAIFD_BIT_RATE_SHIFT_INT_ENA_M  (TWAIFD_BIT_RATE_SHIFT_INT_ENA_V << TWAIFD_BIT_RATE_SHIFT_INT_ENA_S)
#define TWAIFD_BIT_RATE_SHIFT_INT_ENA_V  0x00000001U
#define TWAIFD_BIT_RATE_SHIFT_INT_ENA_S  10
/** TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  Write 1 to enable TWAIFD_RX_BUF_NOT_EMPTY_INT.
 */
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA    (BIT(11))
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA_M  (TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA_V << TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA_S)
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA_V  0x00000001U
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ENA_S  11
/** TWAIFD_TX_BUF_STATUS_CHG_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  Write 1 to enable TWAIFD_TX_BUF_STATUS_CHG_INT.
 */
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ENA    (BIT(12))
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ENA_M  (TWAIFD_TX_BUF_STATUS_CHG_INT_ENA_V << TWAIFD_TX_BUF_STATUS_CHG_INT_ENA_S)
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ENA_V  0x00000001U
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ENA_S  12

