espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/** TWAIFD_INT_ST_REG register
 *  TWAI FD interrupt status register
 */
#define TWAIFD_INT_ST_REG (DR_REG_TWAIFD_BASE + 0x18)
/** TWAIFD_RX_FRM_SUC_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status of TWAIFD_RX_FRM_SUC_INT.
 */
#define TWAIFD_RX_FRM_SUC_INT_ST    (BIT(0))
#define TWAIFD_RX_FRM_SUC_INT_ST_M  (TWAIFD_RX_FRM_SUC_INT_ST_V << TWAIFD_RX_FRM_SUC_INT_ST_S)
#define TWAIFD_RX_FRM_SUC_INT_ST_V  0x00000001U
#define TWAIFD_RX_FRM_SUC_INT_ST_S  0
/** TWAIFD_TX_FRM_SUC_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status of TWAIFD_TX_FRM_SUC_INT.
 */
#define TWAIFD_TX_FRM_SUC_INT_ST    (BIT(1))
#define TWAIFD_TX_FRM_SUC_INT_ST_M  (TWAIFD_TX_FRM_SUC_INT_ST_V << TWAIFD_TX_FRM_SUC_INT_ST_S)
#define TWAIFD_TX_FRM_SUC_INT_ST_V  0x00000001U
#define TWAIFD_TX_FRM_SUC_INT_ST_S  1
/** TWAIFD_ERR_WARNING_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status of TWAIFD_ERR_WARNING_INT.
 */
#define TWAIFD_ERR_WARNING_INT_ST    (BIT(2))
#define TWAIFD_ERR_WARNING_INT_ST_M  (TWAIFD_ERR_WARNING_INT_ST_V << TWAIFD_ERR_WARNING_INT_ST_S)
#define TWAIFD_ERR_WARNING_INT_ST_V  0x00000001U
#define TWAIFD_ERR_WARNING_INT_ST_S  2
/** TWAIFD_RX_DATA_OVERRUN_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status of TWAIFD_RX_DATA_OVERRUN_INT.
 */
#define TWAIFD_RX_DATA_OVERRUN_INT_ST    (BIT(3))
#define TWAIFD_RX_DATA_OVERRUN_INT_ST_M  (TWAIFD_RX_DATA_OVERRUN_INT_ST_V << TWAIFD_RX_DATA_OVERRUN_INT_ST_S)
#define TWAIFD_RX_DATA_OVERRUN_INT_ST_V  0x00000001U
#define TWAIFD_RX_DATA_OVERRUN_INT_ST_S  3
/** TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status of TWAIFD_FAULT_CONFINEMENT_CHG_INT.
 */
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST    (BIT(5))
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST_M  (TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST_V << TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST_S)
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST_V  0x00000001U
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_ST_S  5
/** TWAIFD_ARB_LOST_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status of TWAIFD_ARB_LOST_INT.
 */
#define TWAIFD_ARB_LOST_INT_ST    (BIT(6))
#define TWAIFD_ARB_LOST_INT_ST_M  (TWAIFD_ARB_LOST_INT_ST_V << TWAIFD_ARB_LOST_INT_ST_S)
#define TWAIFD_ARB_LOST_INT_ST_V  0x00000001U
#define TWAIFD_ARB_LOST_INT_ST_S  6
/** TWAIFD_ERR_DETECTED_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status of TWAIFD_ERR_DETECTED_INT.
 */
#define TWAIFD_ERR_DETECTED_INT_ST    (BIT(7))
#define TWAIFD_ERR_DETECTED_INT_ST_M  (TWAIFD_ERR_DETECTED_INT_ST_V << TWAIFD_ERR_DETECTED_INT_ST_S)
#define TWAIFD_ERR_DETECTED_INT_ST_V  0x00000001U
#define TWAIFD_ERR_DETECTED_INT_ST_S  7
/** TWAIFD_IS_OVERLOAD_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status of TWAIFD_IS_OVERLOAD_INT.
 */
#define TWAIFD_IS_OVERLOAD_INT_ST    (BIT(8))
#define TWAIFD_IS_OVERLOAD_INT_ST_M  (TWAIFD_IS_OVERLOAD_INT_ST_V << TWAIFD_IS_OVERLOAD_INT_ST_S)
#define TWAIFD_IS_OVERLOAD_INT_ST_V  0x00000001U
#define TWAIFD_IS_OVERLOAD_INT_ST_S  8
/** TWAIFD_RX_BUF_FULL_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status of TWAIFD_RX_BUF_FULL_INT.
 */
#define TWAIFD_RX_BUF_FULL_INT_ST    (BIT(9))
#define TWAIFD_RX_BUF_FULL_INT_ST_M  (TWAIFD_RX_BUF_FULL_INT_ST_V << TWAIFD_RX_BUF_FULL_INT_ST_S)
#define TWAIFD_RX_BUF_FULL_INT_ST_V  0x00000001U
#define TWAIFD_RX_BUF_FULL_INT_ST_S  9
/** TWAIFD_BIT_RATE_SHIFT_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status of TWAIFD_BIT_RATE_SHIFT_INT.
 */
#define TWAIFD_BIT_RATE_SHIFT_INT_ST    (BIT(10))
#define TWAIFD_BIT_RATE_SHIFT_INT_ST_M  (TWAIFD_BIT_RATE_SHIFT_INT_ST_V << TWAIFD_BIT_RATE_SHIFT_INT_ST_S)
#define TWAIFD_BIT_RATE_SHIFT_INT_ST_V  0x00000001U
#define TWAIFD_BIT_RATE_SHIFT_INT_ST_S  10
/** TWAIFD_RX_BUF_NOT_EMPTY_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status of TWAIFD_RX_BUF_NOT_EMPTY_INT.
 */
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ST    (BIT(11))
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ST_M  (TWAIFD_RX_BUF_NOT_EMPTY_INT_ST_V << TWAIFD_RX_BUF_NOT_EMPTY_INT_ST_S)
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ST_V  0x00000001U
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_ST_S  11
/** TWAIFD_TX_BUF_STATUS_CHG_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status of TWAIFD_TX_BUF_STATUS_CHG_INT.
 */
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ST    (BIT(12))
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ST_M  (TWAIFD_TX_BUF_STATUS_CHG_INT_ST_V << TWAIFD_TX_BUF_STATUS_CHG_INT_ST_S)
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ST_V  0x00000001U
#define TWAIFD_TX_BUF_STATUS_CHG_INT_ST_S  12

/** TWAIFD_INT_CLR_REG register
 *  TWAI FD interrupt clear register
 */
#define TWAIFD_INT_CLR_REG (DR_REG_TWAIFD_BASE + 0x1c)
/** TWAIFD_RX_FRM_SUC_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear TWAIFD_RX_FRM_SUC_INT.
 */
#define TWAIFD_RX_FRM_SUC_INT_CLR    (BIT(0))
#define TWAIFD_RX_FRM_SUC_INT_CLR_M  (TWAIFD_RX_FRM_SUC_INT_CLR_V << TWAIFD_RX_FRM_SUC_INT_CLR_S)
#define TWAIFD_RX_FRM_SUC_INT_CLR_V  0x00000001U
#define TWAIFD_RX_FRM_SUC_INT_CLR_S  0
/** TWAIFD_TX_FRM_SUC_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear TWAIFD_TX_FRM_SUC_INT.
 */
#define TWAIFD_TX_FRM_SUC_INT_CLR    (BIT(1))
#define TWAIFD_TX_FRM_SUC_INT_CLR_M  (TWAIFD_TX_FRM_SUC_INT_CLR_V << TWAIFD_TX_FRM_SUC_INT_CLR_S)
#define TWAIFD_TX_FRM_SUC_INT_CLR_V  0x00000001U
#define TWAIFD_TX_FRM_SUC_INT_CLR_S  1
/** TWAIFD_ERR_WARNING_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear TWAIFD_ERR_WARNING_INT.
 */
#define TWAIFD_ERR_WARNING_INT_CLR    (BIT(2))
#define TWAIFD_ERR_WARNING_INT_CLR_M  (TWAIFD_ERR_WARNING_INT_CLR_V << TWAIFD_ERR_WARNING_INT_CLR_S)
#define TWAIFD_ERR_WARNING_INT_CLR_V  0x00000001U
#define TWAIFD_ERR_WARNING_INT_CLR_S  2
/** TWAIFD_RX_DATA_OVERRUN_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear TWAIFD_RX_DATA_OVERRUN_INT.
 */
#define TWAIFD_RX_DATA_OVERRUN_INT_CLR    (BIT(3))
#define TWAIFD_RX_DATA_OVERRUN_INT_CLR_M  (TWAIFD_RX_DATA_OVERRUN_INT_CLR_V << TWAIFD_RX_DATA_OVERRUN_INT_CLR_S)
#define TWAIFD_RX_DATA_OVERRUN_INT_CLR_V  0x00000001U
#define TWAIFD_RX_DATA_OVERRUN_INT_CLR_S  3
/** TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear TWAIFD_FAULT_CONFINEMENT_CHG_INT.
 */
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR    (BIT(5))
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR_M  (TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR_V << TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR_S)
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR_V  0x00000001U
#define TWAIFD_FAULT_CONFINEMENT_CHG_INT_CLR_S  5
/** TWAIFD_ARB_LOST_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear TWAIFD_ARB_LOST_INT.
 */
#define TWAIFD_ARB_LOST_INT_CLR    (BIT(6))
#define TWAIFD_ARB_LOST_INT_CLR_M  (TWAIFD_ARB_LOST_INT_CLR_V << TWAIFD_ARB_LOST_INT_CLR_S)
#define TWAIFD_ARB_LOST_INT_CLR_V  0x00000001U
#define TWAIFD_ARB_LOST_INT_CLR_S  6
/** TWAIFD_ERR_DETECTED_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Write 1 to clear TWAIFD_ERR_DETECTED_INT.
 */
#define TWAIFD_ERR_DETECTED_INT_CLR    (BIT(7))
#define TWAIFD_ERR_DETECTED_INT_CLR_M  (TWAIFD_ERR_DETECTED_INT_CLR_V << TWAIFD_ERR_DETECTED_INT_CLR_S)
#define TWAIFD_ERR_DETECTED_INT_CLR_V  0x00000001U
#define TWAIFD_ERR_DETECTED_INT_CLR_S  7
/** TWAIFD_IS_OVERLOAD_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Write 1 to clear TWAIFD_IS_OVERLOAD_INT.
 */
#define TWAIFD_IS_OVERLOAD_INT_CLR    (BIT(8))
#define TWAIFD_IS_OVERLOAD_INT_CLR_M  (TWAIFD_IS_OVERLOAD_INT_CLR_V << TWAIFD_IS_OVERLOAD_INT_CLR_S)
#define TWAIFD_IS_OVERLOAD_INT_CLR_V  0x00000001U
#define TWAIFD_IS_OVERLOAD_INT_CLR_S  8
/** TWAIFD_RX_BUF_FULL_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Write 1 to clear TWAIFD_RX_BUF_FULL_INT.
 */
#define TWAIFD_RX_BUF_FULL_INT_CLR    (BIT(9))
#define TWAIFD_RX_BUF_FULL_INT_CLR_M  (TWAIFD_RX_BUF_FULL_INT_CLR_V << TWAIFD_RX_BUF_FULL_INT_CLR_S)
#define TWAIFD_RX_BUF_FULL_INT_CLR_V  0x00000001U
#define TWAIFD_RX_BUF_FULL_INT_CLR_S  9
/** TWAIFD_BIT_RATE_SHIFT_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Write 1 to clear TWAIFD_BIT_RATE_SHIFT_INT.
 */
#define TWAIFD_BIT_RATE_SHIFT_INT_CLR    (BIT(10))
#define TWAIFD_BIT_RATE_SHIFT_INT_CLR_M  (TWAIFD_BIT_RATE_SHIFT_INT_CLR_V << TWAIFD_BIT_RATE_SHIFT_INT_CLR_S)
#define TWAIFD_BIT_RATE_SHIFT_INT_CLR_V  0x00000001U
#define TWAIFD_BIT_RATE_SHIFT_INT_CLR_S  10
/** TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Write 1 to clear TWAIFD_RX_BUF_NOT_EMPTY_INT.
 */
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR    (BIT(11))
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR_M  (TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR_V << TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR_S)
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR_V  0x00000001U
#define TWAIFD_RX_BUF_NOT_EMPTY_INT_CLR_S  11
/** TWAIFD_TX_BUF_STATUS_CHG_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Write 1 to clear TWAIFD_TX_BUF_STATUS_CHG_INT.
 */
#define TWAIFD_TX_BUF_STATUS_CHG_INT_CLR    (BIT(12))
#define TWAIFD_TX_BUF_STATUS_CHG_INT_CLR_M  (TWAIFD_TX_BUF_STATUS_CHG_INT_CLR_V << TWAIFD_TX_BUF_STATUS_CHG_INT_CLR_S)
#define TWAIFD_TX_BUF_STATUS_CHG_INT_CLR_V  0x00000001U
#define TWAIFD_TX_BUF_STATUS_CHG_INT_CLR_S  12

