espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/** TWAIFD_BIT_TIMING_REG register
 *  TWAI FD bit-timing  register
 */
#define TWAIFD_BIT_TIMING_REG (DR_REG_TWAIFD_BASE + 0x20)
/** TWAIFD_PROP : R/W; bitpos: [6:0]; default: 5;
 *  Configures the propagation segment of nominal bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PROP    0x0000007FU
#define TWAIFD_PROP_M  (TWAIFD_PROP_V << TWAIFD_PROP_S)
#define TWAIFD_PROP_V  0x0000007FU
#define TWAIFD_PROP_S  0
/** TWAIFD_PH1 : R/W; bitpos: [12:7]; default: 3;
 *  Configures the phase 1 segment of nominal bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PH1    0x0000003FU
#define TWAIFD_PH1_M  (TWAIFD_PH1_V << TWAIFD_PH1_S)
#define TWAIFD_PH1_V  0x0000003FU
#define TWAIFD_PH1_S  7
/** TWAIFD_PH2 : R/W; bitpos: [18:13]; default: 5;
 *  Configures the phase 2 segment of nominal bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PH2    0x0000003FU
#define TWAIFD_PH2_M  (TWAIFD_PH2_V << TWAIFD_PH2_S)
#define TWAIFD_PH2_V  0x0000003FU
#define TWAIFD_PH2_S  13
/** TWAIFD_BRP : R/W; bitpos: [26:19]; default: 16;
 *  Configures the baud-rate prescaler of nominal bit rate.\\
 *  Measurement unit: cycle of core clock.
 */
#define TWAIFD_BRP    0x000000FFU
#define TWAIFD_BRP_M  (TWAIFD_BRP_V << TWAIFD_BRP_S)
#define TWAIFD_BRP_V  0x000000FFU
#define TWAIFD_BRP_S  19
/** TWAIFD_SJW : R/W; bitpos: [31:27]; default: 2;
 *  Represents the synchronization jump width in nominal bit time.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_SJW    0x0000001FU
#define TWAIFD_SJW_M  (TWAIFD_SJW_V << TWAIFD_SJW_S)
#define TWAIFD_SJW_V  0x0000001FU
#define TWAIFD_SJW_S  27

/** TWAIFD_BIT_TIMEING_FD_REG register
 *  TWAI FD bit-timing of FD register
 */
#define TWAIFD_BIT_TIMEING_FD_REG (DR_REG_TWAIFD_BASE + 0x24)
/** TWAIFD_PROP_FD : R/W; bitpos: [5:0]; default: 3;
 *  Configures the propagation segment of data bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PROP_FD    0x0000003FU
#define TWAIFD_PROP_FD_M  (TWAIFD_PROP_FD_V << TWAIFD_PROP_FD_S)
#define TWAIFD_PROP_FD_V  0x0000003FU
#define TWAIFD_PROP_FD_S  0
/** TWAIFD_PH1_FD : R/W; bitpos: [11:7]; default: 3;
 *  Configures the phase 1 segment of data bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PH1_FD    0x0000001FU
#define TWAIFD_PH1_FD_M  (TWAIFD_PH1_FD_V << TWAIFD_PH1_FD_S)
#define TWAIFD_PH1_FD_V  0x0000001FU
#define TWAIFD_PH1_FD_S  7
/** TWAIFD_PH2_FD : R/W; bitpos: [17:13]; default: 3;
 *  Configures the phase 2 segment of data bit rate.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_PH2_FD    0x0000001FU
#define TWAIFD_PH2_FD_M  (TWAIFD_PH2_FD_V << TWAIFD_PH2_FD_S)
#define TWAIFD_PH2_FD_V  0x0000001FU
#define TWAIFD_PH2_FD_S  13
/** TWAIFD_BRP_FD : R/W; bitpos: [26:19]; default: 4;
 *  Configures the baud-rate prescaler of data bit rate.\\
 *  Measurement unit: cycle of core clock.
 */
#define TWAIFD_BRP_FD    0x000000FFU
#define TWAIFD_BRP_FD_M  (TWAIFD_BRP_FD_V << TWAIFD_BRP_FD_S)
#define TWAIFD_BRP_FD_V  0x000000FFU
#define TWAIFD_BRP_FD_S  19
/** TWAIFD_SJW_FD : R/W; bitpos: [31:27]; default: 2;
 *  Represents the synchronization jump width in data bit time.\\
 *  Measurement unit: time quanta\\
 */
#define TWAIFD_SJW_FD    0x0000001FU
#define TWAIFD_SJW_FD_M  (TWAIFD_SJW_FD_V << TWAIFD_SJW_FD_S)
#define TWAIFD_SJW_FD_V  0x0000001FU
#define TWAIFD_SJW_FD_S  27

/** TWAIFD_ERR_TH_STAT_REG register
 *  TWAI FD error threshold and status register
 */
#define TWAIFD_ERR_TH_STAT_REG (DR_REG_TWAIFD_BASE + 0x28)
/** TWAIFD_ERR_WARNING_THRES : R/W; bitpos: [7:0]; default: 96;
 *  Configures the error warning threshold.\\
 */
#define TWAIFD_ERR_WARNING_THRES    0x000000FFU
#define TWAIFD_ERR_WARNING_THRES_M  (TWAIFD_ERR_WARNING_THRES_V << TWAIFD_ERR_WARNING_THRES_S)
#define TWAIFD_ERR_WARNING_THRES_V  0x000000FFU
#define TWAIFD_ERR_WARNING_THRES_S  0
/** TWAIFD_ERR_PASSIVE_THRES : R/W; bitpos: [15:8]; default: 128;
 *  Configures the error passive threshold.\\
 */
#define TWAIFD_ERR_PASSIVE_THRES    0x000000FFU
#define TWAIFD_ERR_PASSIVE_THRES_M  (TWAIFD_ERR_PASSIVE_THRES_V << TWAIFD_ERR_PASSIVE_THRES_S)
#define TWAIFD_ERR_PASSIVE_THRES_V  0x000000FFU
#define TWAIFD_ERR_PASSIVE_THRES_S  8
/** TWAIFD_ERR_ACTIVE : RO; bitpos: [16]; default: 1;
 *  Represents the fault state of error active.\\
 */
#define TWAIFD_ERR_ACTIVE    (BIT(16))
#define TWAIFD_ERR_ACTIVE_M  (TWAIFD_ERR_ACTIVE_V << TWAIFD_ERR_ACTIVE_S)
#define TWAIFD_ERR_ACTIVE_V  0x00000001U
#define TWAIFD_ERR_ACTIVE_S  16
/** TWAIFD_ERR_PASSIVE : RO; bitpos: [17]; default: 0;
 *  Represents the fault state of error passive.\\
 */
#define TWAIFD_ERR_PASSIVE    (BIT(17))
#define TWAIFD_ERR_PASSIVE_M  (TWAIFD_ERR_PASSIVE_V << TWAIFD_ERR_PASSIVE_S)
#define TWAIFD_ERR_PASSIVE_V  0x00000001U
#define TWAIFD_ERR_PASSIVE_S  17
/** TWAIFD_BUS_OFF : RO; bitpos: [18]; default: 0;
 *  Represents the fault state of bus off.\\
 */
#define TWAIFD_BUS_OFF    (BIT(18))
#define TWAIFD_BUS_OFF_M  (TWAIFD_BUS_OFF_V << TWAIFD_BUS_OFF_S)
#define TWAIFD_BUS_OFF_V  0x00000001U
#define TWAIFD_BUS_OFF_S  18

/** TWAIFD_ERROR_COUNTERS_REG register
 *  TWAI FD error counters status register
 */
#define TWAIFD_ERROR_COUNTERS_REG (DR_REG_TWAIFD_BASE + 0x2c)
/** TWAIFD_RXC_VAL : RO; bitpos: [15:0]; default: 0;
 *  Represents the receiver error counter value.\\
 */
#define TWAIFD_RXC_VAL    0x0000FFFFU
#define TWAIFD_RXC_VAL_M  (TWAIFD_RXC_VAL_V << TWAIFD_RXC_VAL_S)
#define TWAIFD_RXC_VAL_V  0x0000FFFFU
#define TWAIFD_RXC_VAL_S  0
/** TWAIFD_TXC_VAL : RO; bitpos: [31:16]; default: 0;
 *  Represents the transmitter error counter value.\\
 */
#define TWAIFD_TXC_VAL    0x0000FFFFU
#define TWAIFD_TXC_VAL_M  (TWAIFD_TXC_VAL_V << TWAIFD_TXC_VAL_S)
#define TWAIFD_TXC_VAL_V  0x0000FFFFU
#define TWAIFD_TXC_VAL_S  16

/** TWAIFD_ERROR_COUNTERS_SP_REG register
 *  TWAI FD special error counters status register
 */
#define TWAIFD_ERROR_COUNTERS_SP_REG (DR_REG_TWAIFD_BASE + 0x30)
/** TWAIFD_ERR_FD_VAL : RO; bitpos: [15:0]; default: 0;
 *  Represents the number of error in the data bit time.\\
 */
#define TWAIFD_ERR_FD_VAL    0x0000FFFFU
#define TWAIFD_ERR_FD_VAL_M  (TWAIFD_ERR_FD_VAL_V << TWAIFD_ERR_FD_VAL_S)
#define TWAIFD_ERR_FD_VAL_V  0x0000FFFFU
#define TWAIFD_ERR_FD_VAL_S  0
/** TWAIFD_ERR_NORM_VAL : RO; bitpos: [31:16]; default: 0;
 *  Represents the number of error in the nominal bit time.\\
 */
#define TWAIFD_ERR_NORM_VAL    0x0000FFFFU
#define TWAIFD_ERR_NORM_VAL_M  (TWAIFD_ERR_NORM_VAL_V << TWAIFD_ERR_NORM_VAL_S)
#define TWAIFD_ERR_NORM_VAL_V  0x0000FFFFU
#define TWAIFD_ERR_NORM_VAL_S  16

/** TWAIFD_CTR_PRES_REG register
 *  TWAI FD error counters pre-define configuration register
 */
#define TWAIFD_CTR_PRES_REG (DR_REG_TWAIFD_BASE + 0x34)
/** TWAIFD_CTR_PRES_VAL : WO; bitpos: [8:0]; default: 0;
 *  Configures the pre-defined value to set the error counter.\\
 */
#define TWAIFD_CTR_PRES_VAL    0x000001FFU
#define TWAIFD_CTR_PRES_VAL_M  (TWAIFD_CTR_PRES_VAL_V << TWAIFD_CTR_PRES_VAL_S)
#define TWAIFD_CTR_PRES_VAL_V  0x000001FFU
#define TWAIFD_CTR_PRES_VAL_S  0
/** TWAIFD_PTX : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to set the receiver error counter into the value of
 *  pre-defined value.\\
 *  0: invalid\\
 *  1: set\\
 */
#define TWAIFD_PTX    (BIT(9))
#define TWAIFD_PTX_M  (TWAIFD_PTX_V << TWAIFD_PTX_S)
#define TWAIFD_PTX_V  0x00000001U
#define TWAIFD_PTX_S  9
/** TWAIFD_PRX : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to set the transmitter error counter into the value of
 *  pre-defined value.\\
 *  0: invalid\\
 *  1: set\\
 */
#define TWAIFD_PRX    (BIT(10))
#define TWAIFD_PRX_M  (TWAIFD_PRX_V << TWAIFD_PRX_S)
#define TWAIFD_PRX_V  0x00000001U
#define TWAIFD_PRX_S  10
/** TWAIFD_ENORM : WO; bitpos: [11]; default: 0;
 *  Configures whether or not to erase the error counter of nominal bit time.\\
 *  0: invalid\\
 *  1: erase\\
 */
#define TWAIFD_ENORM    (BIT(11))
#define TWAIFD_ENORM_M  (TWAIFD_ENORM_V << TWAIFD_ENORM_S)
#define TWAIFD_ENORM_V  0x00000001U
#define TWAIFD_ENORM_S  11
/** TWAIFD_EFD : WO; bitpos: [12]; default: 0;
 *  Configures whether or not to erase the error counter of data bit time.\\
 *  0: invalid\\
 *  1: erase\\
 */
#define TWAIFD_EFD    (BIT(12))
#define TWAIFD_EFD_M  (TWAIFD_EFD_V << TWAIFD_EFD_S)
#define TWAIFD_EFD_V  0x00000001U
#define TWAIFD_EFD_S  12

/** TWAIFD_RX_MEM_INFO_REG register
 *  TWAI FD rx memory information register
 */
#define TWAIFD_RX_MEM_INFO_REG (DR_REG_TWAIFD_BASE + 0x38)
/** TWAIFD_RX_BUFF_SIZE_VAL : RO; bitpos: [12:0]; default: 0;
 *  Represents the size of RX buffer.\\
 */
#define TWAIFD_RX_BUFF_SIZE_VAL    0x00001FFFU
#define TWAIFD_RX_BUFF_SIZE_VAL_M  (TWAIFD_RX_BUFF_SIZE_VAL_V << TWAIFD_RX_BUFF_SIZE_VAL_S)
#define TWAIFD_RX_BUFF_SIZE_VAL_V  0x00001FFFU
#define TWAIFD_RX_BUFF_SIZE_VAL_S  0
/** TWAIFD_RX_FREE_CTR : RO; bitpos: [28:16]; default: 0;
 *  Represents the number of free words in RX buffer.\\
 */
#define TWAIFD_RX_FREE_CTR    0x00001FFFU
#define TWAIFD_RX_FREE_CTR_M  (TWAIFD_RX_FREE_CTR_V << TWAIFD_RX_FREE_CTR_S)
#define TWAIFD_RX_FREE_CTR_V  0x00001FFFU
#define TWAIFD_RX_FREE_CTR_S  16

/** TWAIFD_RX_POINTERS_REG register
 *  TWAI FD rx memory pointer information register
 */
#define TWAIFD_RX_POINTERS_REG (DR_REG_TWAIFD_BASE + 0x3c)
/** TWAIFD_RX_WPT_VAL : RO; bitpos: [11:0]; default: 0;
 *  Represents the write pointer position in RX buffer.\\
 */
#define TWAIFD_RX_WPT_VAL    0x00000FFFU
#define TWAIFD_RX_WPT_VAL_M  (TWAIFD_RX_WPT_VAL_V << TWAIFD_RX_WPT_VAL_S)
#define TWAIFD_RX_WPT_VAL_V  0x00000FFFU
#define TWAIFD_RX_WPT_VAL_S  0
/** TWAIFD_RX_RPT_VAL : RO; bitpos: [27:16]; default: 0;
 *  Represents the read pointer position in RX buffer.\\
 */
#define TWAIFD_RX_RPT_VAL    0x00000FFFU
#define TWAIFD_RX_RPT_VAL_M  (TWAIFD_RX_RPT_VAL_V << TWAIFD_RX_RPT_VAL_S)
#define TWAIFD_RX_RPT_VAL_V  0x00000FFFU
#define TWAIFD_RX_RPT_VAL_S  16

/** TWAIFD_RX_STATUS_SETTING_REG register
 *  TWAI FD tx status & setting register
 */
#define TWAIFD_RX_STATUS_SETTING_REG (DR_REG_TWAIFD_BASE + 0x40)
/** TWAIFD_RX_EMPTY : RO; bitpos: [0]; default: 0;
 *  Represents whether or not the RX buffer is empty.\\
 *  0: not empty\\
 *  1: empty\\
 */
#define TWAIFD_RX_EMPTY    (BIT(0))
#define TWAIFD_RX_EMPTY_M  (TWAIFD_RX_EMPTY_V << TWAIFD_RX_EMPTY_S)
#define TWAIFD_RX_EMPTY_V  0x00000001U
#define TWAIFD_RX_EMPTY_S  0
/** TWAIFD_RX_FULL : RO; bitpos: [1]; default: 0;
 *  Represents whether or not the RX buffer is full.\\
 *  0: not full\\
 *  1: full\\
 */
#define TWAIFD_RX_FULL    (BIT(1))
#define TWAIFD_RX_FULL_M  (TWAIFD_RX_FULL_V << TWAIFD_RX_FULL_S)
#define TWAIFD_RX_FULL_V  0x00000001U
#define TWAIFD_RX_FULL_S  1
/** TWAIFD_RX_FRM_CTR : RO; bitpos: [14:4]; default: 0;
 *  Represents the number of received frame in RX buffer.\\
 */
#define TWAIFD_RX_FRM_CTR    0x000007FFU
#define TWAIFD_RX_FRM_CTR_M  (TWAIFD_RX_FRM_CTR_V << TWAIFD_RX_FRM_CTR_S)
#define TWAIFD_RX_FRM_CTR_V  0x000007FFU
#define TWAIFD_RX_FRM_CTR_S  4
/** TWAIFD_RTSOP : R/W; bitpos: [16]; default: 0;
 *  a\\
 */
#define TWAIFD_RTSOP    (BIT(16))
#define TWAIFD_RTSOP_M  (TWAIFD_RTSOP_V << TWAIFD_RTSOP_S)
#define TWAIFD_RTSOP_V  0x00000001U
#define TWAIFD_RTSOP_S  16

