espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/** TWAIFD_RX_DATA_REG register
 *  TWAI FD received data register
 */
#define TWAIFD_RX_DATA_REG (DR_REG_TWAIFD_BASE + 0x44)
/** TWAIFD_RX_DATA : RO; bitpos: [31:0]; default: 0;
 *  Data received.
 */
#define TWAIFD_RX_DATA    0xFFFFFFFFU
#define TWAIFD_RX_DATA_M  (TWAIFD_RX_DATA_V << TWAIFD_RX_DATA_S)
#define TWAIFD_RX_DATA_V  0xFFFFFFFFU
#define TWAIFD_RX_DATA_S  0

/** TWAIFD_FILTER_A_MASK_REG register
 *  TWAI FD filter A mask value register
 */
#define TWAIFD_FILTER_A_MASK_REG (DR_REG_TWAIFD_BASE + 0x60)
/** TWAIFD_BIT_MASK_A : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit masked value.
 */
#define TWAIFD_BIT_MASK_A    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_A_M  (TWAIFD_BIT_MASK_A_V << TWAIFD_BIT_MASK_A_S)
#define TWAIFD_BIT_MASK_A_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_A_S  0

/** TWAIFD_FILTER_A_VAL_REG register
 *  TWAI FD filter A bit value register
 */
#define TWAIFD_FILTER_A_VAL_REG (DR_REG_TWAIFD_BASE + 0x64)
/** TWAIFD_BIT_VAL_A : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit value.
 */
#define TWAIFD_BIT_VAL_A    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_A_M  (TWAIFD_BIT_VAL_A_V << TWAIFD_BIT_VAL_A_S)
#define TWAIFD_BIT_VAL_A_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_A_S  0

/** TWAIFD_FILTER_B_MASK_REG register
 *  TWAI FD filter B mask value register
 */
#define TWAIFD_FILTER_B_MASK_REG (DR_REG_TWAIFD_BASE + 0x68)
/** TWAIFD_BIT_MASK_B : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit masked value.
 */
#define TWAIFD_BIT_MASK_B    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_B_M  (TWAIFD_BIT_MASK_B_V << TWAIFD_BIT_MASK_B_S)
#define TWAIFD_BIT_MASK_B_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_B_S  0

/** TWAIFD_FILTER_B_VAL_REG register
 *  TWAI FD filter B bit value register
 */
#define TWAIFD_FILTER_B_VAL_REG (DR_REG_TWAIFD_BASE + 0x6c)
/** TWAIFD_BIT_VAL_B : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit value.
 */
#define TWAIFD_BIT_VAL_B    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_B_M  (TWAIFD_BIT_VAL_B_V << TWAIFD_BIT_VAL_B_S)
#define TWAIFD_BIT_VAL_B_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_B_S  0

/** TWAIFD_FILTER_C_MASK_REG register
 *  TWAI FD filter C mask value register
 */
#define TWAIFD_FILTER_C_MASK_REG (DR_REG_TWAIFD_BASE + 0x70)
/** TWAIFD_BIT_MASK_C : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit masked value.
 */
#define TWAIFD_BIT_MASK_C    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_C_M  (TWAIFD_BIT_MASK_C_V << TWAIFD_BIT_MASK_C_S)
#define TWAIFD_BIT_MASK_C_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_C_S  0

/** TWAIFD_FILTER_C_VAL_REG register
 *  TWAI FD filter C bit value register
 */
#define TWAIFD_FILTER_C_VAL_REG (DR_REG_TWAIFD_BASE + 0x74)
/** TWAIFD_BIT_VAL_C : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit value.
 */
#define TWAIFD_BIT_VAL_C    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_C_M  (TWAIFD_BIT_VAL_C_V << TWAIFD_BIT_VAL_C_S)
#define TWAIFD_BIT_VAL_C_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_C_S  0

/** TWAIFD_FILTER_RAN_LOW_REG register
 *  TWAI FD filter range low value register
 */
#define TWAIFD_FILTER_RAN_LOW_REG (DR_REG_TWAIFD_BASE + 0x78)
/** TWAIFD_BIT_RAN_LOW : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit masked value.
 */
#define TWAIFD_BIT_RAN_LOW    0x1FFFFFFFU
#define TWAIFD_BIT_RAN_LOW_M  (TWAIFD_BIT_RAN_LOW_V << TWAIFD_BIT_RAN_LOW_S)
#define TWAIFD_BIT_RAN_LOW_V  0x1FFFFFFFU
#define TWAIFD_BIT_RAN_LOW_S  0

/** TWAIFD_FILTER_RAN_HIGH_REG register
 *  TWAI FD filter range high value register
 */
#define TWAIFD_FILTER_RAN_HIGH_REG (DR_REG_TWAIFD_BASE + 0x7c)
/** TWAIFD_BIT_RAN_HIGH : R/W; bitpos: [28:0]; default: 0;
 *  filter A bit value.
 */
#define TWAIFD_BIT_RAN_HIGH    0x1FFFFFFFU
#define TWAIFD_BIT_RAN_HIGH_M  (TWAIFD_BIT_RAN_HIGH_V << TWAIFD_BIT_RAN_HIGH_S)
#define TWAIFD_BIT_RAN_HIGH_V  0x1FFFFFFFU
#define TWAIFD_BIT_RAN_HIGH_S  0

/** TWAIFD_FILTER_CONTROL_REG register
 *  TWAI FD filter control register
 */
#define TWAIFD_FILTER_CONTROL_REG (DR_REG_TWAIFD_BASE + 0x80)
/** TWAIFD_FANB : R/W; bitpos: [0]; default: 1;
 *  filter A with nominal and base mode.
 */
#define TWAIFD_FANB    (BIT(0))
#define TWAIFD_FANB_M  (TWAIFD_FANB_V << TWAIFD_FANB_S)
#define TWAIFD_FANB_V  0x00000001U
#define TWAIFD_FANB_S  0
/** TWAIFD_FANE : R/W; bitpos: [1]; default: 1;
 *  filter A with nominal and extended mode.
 */
#define TWAIFD_FANE    (BIT(1))
#define TWAIFD_FANE_M  (TWAIFD_FANE_V << TWAIFD_FANE_S)
#define TWAIFD_FANE_V  0x00000001U
#define TWAIFD_FANE_S  1
/** TWAIFD_FAFB : R/W; bitpos: [2]; default: 1;
 *  filter A with FD and base mode.
 */
#define TWAIFD_FAFB    (BIT(2))
#define TWAIFD_FAFB_M  (TWAIFD_FAFB_V << TWAIFD_FAFB_S)
#define TWAIFD_FAFB_V  0x00000001U
#define TWAIFD_FAFB_S  2
/** TWAIFD_FAFE : R/W; bitpos: [3]; default: 1;
 *  filter A with FD and extended mode.
 */
#define TWAIFD_FAFE    (BIT(3))
#define TWAIFD_FAFE_M  (TWAIFD_FAFE_V << TWAIFD_FAFE_S)
#define TWAIFD_FAFE_V  0x00000001U
#define TWAIFD_FAFE_S  3
/** TWAIFD_FBNB : R/W; bitpos: [4]; default: 0;
 *  filter B with nominal and base mode.
 */
#define TWAIFD_FBNB    (BIT(4))
#define TWAIFD_FBNB_M  (TWAIFD_FBNB_V << TWAIFD_FBNB_S)
#define TWAIFD_FBNB_V  0x00000001U
#define TWAIFD_FBNB_S  4
/** TWAIFD_FBNE : R/W; bitpos: [5]; default: 0;
 *  filter B with nominal and extended mode.
 */
#define TWAIFD_FBNE    (BIT(5))
#define TWAIFD_FBNE_M  (TWAIFD_FBNE_V << TWAIFD_FBNE_S)
#define TWAIFD_FBNE_V  0x00000001U
#define TWAIFD_FBNE_S  5
/** TWAIFD_FBFB : R/W; bitpos: [6]; default: 0;
 *  filter B with FD and base mode.
 */
#define TWAIFD_FBFB    (BIT(6))
#define TWAIFD_FBFB_M  (TWAIFD_FBFB_V << TWAIFD_FBFB_S)
#define TWAIFD_FBFB_V  0x00000001U
#define TWAIFD_FBFB_S  6
/** TWAIFD_FBFE : R/W; bitpos: [7]; default: 0;
 *  filter B with FD and extended mode.
 */
#define TWAIFD_FBFE    (BIT(7))
#define TWAIFD_FBFE_M  (TWAIFD_FBFE_V << TWAIFD_FBFE_S)
#define TWAIFD_FBFE_V  0x00000001U
#define TWAIFD_FBFE_S  7
/** TWAIFD_FCNB : R/W; bitpos: [8]; default: 0;
 *  filter C with nominal and base mode.
 */
#define TWAIFD_FCNB    (BIT(8))
#define TWAIFD_FCNB_M  (TWAIFD_FCNB_V << TWAIFD_FCNB_S)
#define TWAIFD_FCNB_V  0x00000001U
#define TWAIFD_FCNB_S  8
/** TWAIFD_FCNE : R/W; bitpos: [9]; default: 0;
 *  filter C with nominal and extended mode.
 */
#define TWAIFD_FCNE    (BIT(9))
#define TWAIFD_FCNE_M  (TWAIFD_FCNE_V << TWAIFD_FCNE_S)
#define TWAIFD_FCNE_V  0x00000001U
#define TWAIFD_FCNE_S  9
/** TWAIFD_FCFB : R/W; bitpos: [10]; default: 0;
 *  filter C with FD and base mode.
 */
#define TWAIFD_FCFB    (BIT(10))
#define TWAIFD_FCFB_M  (TWAIFD_FCFB_V << TWAIFD_FCFB_S)
#define TWAIFD_FCFB_V  0x00000001U
#define TWAIFD_FCFB_S  10
/** TWAIFD_FCFE : R/W; bitpos: [11]; default: 0;
 *  filter C with FD and extended mode.
 */
#define TWAIFD_FCFE    (BIT(11))
#define TWAIFD_FCFE_M  (TWAIFD_FCFE_V << TWAIFD_FCFE_S)
#define TWAIFD_FCFE_V  0x00000001U
#define TWAIFD_FCFE_S  11
/** TWAIFD_FRNB : R/W; bitpos: [12]; default: 0;
 *  filter range with nominal and base mode.
 */
#define TWAIFD_FRNB    (BIT(12))
#define TWAIFD_FRNB_M  (TWAIFD_FRNB_V << TWAIFD_FRNB_S)
#define TWAIFD_FRNB_V  0x00000001U
#define TWAIFD_FRNB_S  12
/** TWAIFD_FRNE : R/W; bitpos: [13]; default: 0;
 *  filter range with nominal and extended mode.
 */
#define TWAIFD_FRNE    (BIT(13))
#define TWAIFD_FRNE_M  (TWAIFD_FRNE_V << TWAIFD_FRNE_S)
#define TWAIFD_FRNE_V  0x00000001U
#define TWAIFD_FRNE_S  13
/** TWAIFD_FRFB : R/W; bitpos: [14]; default: 0;
 *  filter range with FD and base mode.
 */
#define TWAIFD_FRFB    (BIT(14))
#define TWAIFD_FRFB_M  (TWAIFD_FRFB_V << TWAIFD_FRFB_S)
#define TWAIFD_FRFB_V  0x00000001U
#define TWAIFD_FRFB_S  14
/** TWAIFD_FRFE : R/W; bitpos: [15]; default: 0;
 *  filter range with FD and extended mode.
 */
#define TWAIFD_FRFE    (BIT(15))
#define TWAIFD_FRFE_M  (TWAIFD_FRFE_V << TWAIFD_FRFE_S)
#define TWAIFD_FRFE_V  0x00000001U
#define TWAIFD_FRFE_S  15
/** TWAIFD_SFA : RO; bitpos: [16]; default: 0;
 *  filter A status
 */
#define TWAIFD_SFA    (BIT(16))
#define TWAIFD_SFA_M  (TWAIFD_SFA_V << TWAIFD_SFA_S)
#define TWAIFD_SFA_V  0x00000001U
#define TWAIFD_SFA_S  16
/** TWAIFD_SFB : RO; bitpos: [17]; default: 0;
 *  filter B status
 */
#define TWAIFD_SFB    (BIT(17))
#define TWAIFD_SFB_M  (TWAIFD_SFB_V << TWAIFD_SFB_S)
#define TWAIFD_SFB_V  0x00000001U
#define TWAIFD_SFB_S  17
/** TWAIFD_SFC : RO; bitpos: [18]; default: 0;
 *  filter C status
 */
#define TWAIFD_SFC    (BIT(18))
#define TWAIFD_SFC_M  (TWAIFD_SFC_V << TWAIFD_SFC_S)
#define TWAIFD_SFC_V  0x00000001U
#define TWAIFD_SFC_S  18
/** TWAIFD_SFR : RO; bitpos: [19]; default: 0;
 *  filter range status
 */
#define TWAIFD_SFR    (BIT(19))
#define TWAIFD_SFR_M  (TWAIFD_SFR_V << TWAIFD_SFR_S)
#define TWAIFD_SFR_V  0x00000001U
#define TWAIFD_SFR_S  19

/** TWAIFD_TX_STAT_REG register
 *  TWAI FD TX buffer status register
 */
#define TWAIFD_TX_STAT_REG (DR_REG_TWAIFD_BASE + 0x94)
/** TWAIFD_TXT_1_EMPTY : RO; bitpos: [0]; default: 0;
 *  Represents whether or not the TX buffer1 is empty.\\
 *  0: not empty\\
 *  1: empty\\
 */
#define TWAIFD_TXT_1_EMPTY    (BIT(0))
#define TWAIFD_TXT_1_EMPTY_M  (TWAIFD_TXT_1_EMPTY_V << TWAIFD_TXT_1_EMPTY_S)
#define TWAIFD_TXT_1_EMPTY_V  0x00000001U
#define TWAIFD_TXT_1_EMPTY_S  0
/** TWAIFD_TXT_2_EMPTY : RO; bitpos: [1]; default: 0;
 *  Represents whether or not the TX buffer2 is empty.\\
 *  0: not empty\\
 *  1: empty\\
 */
#define TWAIFD_TXT_2_EMPTY    (BIT(1))
#define TWAIFD_TXT_2_EMPTY_M  (TWAIFD_TXT_2_EMPTY_V << TWAIFD_TXT_2_EMPTY_S)
#define TWAIFD_TXT_2_EMPTY_V  0x00000001U
#define TWAIFD_TXT_2_EMPTY_S  1

/** TWAIFD_TX_CFG_REG register
 *  TWAI FD TX buffer configuration register
 */
#define TWAIFD_TX_CFG_REG (DR_REG_TWAIFD_BASE + 0x98)
/** TWAIFD_TXT_1_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether or not allow transmitting frames from TX buffer1.\\
 *  0: not allow\\
 *  1: allow\\
 */
#define TWAIFD_TXT_1_ALLOW    (BIT(0))
#define TWAIFD_TXT_1_ALLOW_M  (TWAIFD_TXT_1_ALLOW_V << TWAIFD_TXT_1_ALLOW_S)
#define TWAIFD_TXT_1_ALLOW_V  0x00000001U
#define TWAIFD_TXT_1_ALLOW_S  0
/** TWAIFD_TXT_2_ALLOW : R/W; bitpos: [1]; default: 1;
 *  Configures whether or not allow transmitting frames from TX buffer2.\\
 *  0: not allow\\
 *  1: allow\\
 */
#define TWAIFD_TXT_2_ALLOW    (BIT(1))
#define TWAIFD_TXT_2_ALLOW_M  (TWAIFD_TXT_2_ALLOW_V << TWAIFD_TXT_2_ALLOW_S)
#define TWAIFD_TXT_2_ALLOW_V  0x00000001U
#define TWAIFD_TXT_2_ALLOW_S  1
/** TWAIFD_TXT_1_COMMIT : WT; bitpos: [2]; default: 0;
 *  Configures whether or not the frames from TX register are inserted into TX
 *  buffer1.\\
 *  0: not inserted\\
 *  1: inserted\\
 */
#define TWAIFD_TXT_1_COMMIT    (BIT(2))
#define TWAIFD_TXT_1_COMMIT_M  (TWAIFD_TXT_1_COMMIT_V << TWAIFD_TXT_1_COMMIT_S)
#define TWAIFD_TXT_1_COMMIT_V  0x00000001U
#define TWAIFD_TXT_1_COMMIT_S  2
/** TWAIFD_TXT_2_COMMIT : WT; bitpos: [3]; default: 0;
 *  Configures whether or not the frames from TX register are inserted into TX
 *  buffer2.\\
 *  0: not inserted\\
 *  1: inserted\\
 */
#define TWAIFD_TXT_2_COMMIT    (BIT(3))
#define TWAIFD_TXT_2_COMMIT_M  (TWAIFD_TXT_2_COMMIT_V << TWAIFD_TXT_2_COMMIT_S)
#define TWAIFD_TXT_2_COMMIT_V  0x00000001U
#define TWAIFD_TXT_2_COMMIT_S  3

/** TWAIFD_TX_DATA_0_REG register
 *  TWAI FD transmit data register 0
 */
#define TWAIFD_TX_DATA_0_REG (DR_REG_TWAIFD_BASE + 0x9c)
/** TWAIFD_DLC_TX : R/W; bitpos: [3:0]; default: 0;
 *  Configures the brs to be transmitted.
 */
#define TWAIFD_DLC_TX    0x0000000FU
#define TWAIFD_DLC_TX_M  (TWAIFD_DLC_TX_V << TWAIFD_DLC_TX_S)
#define TWAIFD_DLC_TX_V  0x0000000FU
#define TWAIFD_DLC_TX_S  0
/** TWAIFD_RTR_TX : R/W; bitpos: [5]; default: 0;
 *  Configures the rtr bit to be transmitted.
 */
#define TWAIFD_RTR_TX    (BIT(5))
#define TWAIFD_RTR_TX_M  (TWAIFD_RTR_TX_V << TWAIFD_RTR_TX_S)
#define TWAIFD_RTR_TX_V  0x00000001U
#define TWAIFD_RTR_TX_S  5
/** TWAIFD_ID_TYPE_TX : R/W; bitpos: [6]; default: 0;
 *  Configures the frame type to be transmitted.
 */
#define TWAIFD_ID_TYPE_TX    (BIT(6))
#define TWAIFD_ID_TYPE_TX_M  (TWAIFD_ID_TYPE_TX_V << TWAIFD_ID_TYPE_TX_S)
#define TWAIFD_ID_TYPE_TX_V  0x00000001U
#define TWAIFD_ID_TYPE_TX_S  6
/** TWAIFD_FR_TYPE_TX : R/W; bitpos: [7]; default: 0;
 *  Configures the fd type to be transmitted.
 */
#define TWAIFD_FR_TYPE_TX    (BIT(7))
#define TWAIFD_FR_TYPE_TX_M  (TWAIFD_FR_TYPE_TX_V << TWAIFD_FR_TYPE_TX_S)
#define TWAIFD_FR_TYPE_TX_V  0x00000001U
#define TWAIFD_FR_TYPE_TX_S  7
/** TWAIFD_TBF_TX : R/W; bitpos: [8]; default: 0;
 *  Configures the tbf bit to be transmitted.
 */
#define TWAIFD_TBF_TX    (BIT(8))
#define TWAIFD_TBF_TX_M  (TWAIFD_TBF_TX_V << TWAIFD_TBF_TX_S)
#define TWAIFD_TBF_TX_V  0x00000001U
#define TWAIFD_TBF_TX_S  8
/** TWAIFD_BRS_TX : R/W; bitpos: [9]; default: 0;
 *  Configures the brs bit to be transmitted.
 */
#define TWAIFD_BRS_TX    (BIT(9))
#define TWAIFD_BRS_TX_M  (TWAIFD_BRS_TX_V << TWAIFD_BRS_TX_S)
#define TWAIFD_BRS_TX_V  0x00000001U
#define TWAIFD_BRS_TX_S  9

