espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_reg.h
/** TWAIFD_TX_DATA_1_REG register
 *  TWAI FD transmit data register 1
 */
#define TWAIFD_TX_DATA_1_REG (DR_REG_TWAIFD_BASE + 0xa0)
/** TWAIFD_TS_VAL_U_TX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the upper timestamp to be transmitted
 */
#define TWAIFD_TS_VAL_U_TX    0xFFFFFFFFU
#define TWAIFD_TS_VAL_U_TX_M  (TWAIFD_TS_VAL_U_TX_V << TWAIFD_TS_VAL_U_TX_S)
#define TWAIFD_TS_VAL_U_TX_V  0xFFFFFFFFU
#define TWAIFD_TS_VAL_U_TX_S  0

/** TWAIFD_TX_DATA_2_REG register
 *  TWAI FD transmit data register 2
 */
#define TWAIFD_TX_DATA_2_REG (DR_REG_TWAIFD_BASE + 0xa4)
/** TWAIFD_TS_VAL_L_TX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the lower timestamp to be transmitted
 */
#define TWAIFD_TS_VAL_L_TX    0xFFFFFFFFU
#define TWAIFD_TS_VAL_L_TX_M  (TWAIFD_TS_VAL_L_TX_V << TWAIFD_TS_VAL_L_TX_S)
#define TWAIFD_TS_VAL_L_TX_V  0xFFFFFFFFU
#define TWAIFD_TS_VAL_L_TX_S  0

/** TWAIFD_TX_DATA_3_REG register
 *  TWAI FD transmit data register 3
 */
#define TWAIFD_TX_DATA_3_REG (DR_REG_TWAIFD_BASE + 0xa8)
/** TWAIFD_ID_EXT_TX : R/W; bitpos: [17:0]; default: 0;
 *  Configures the base ID to be transmitted
 */
#define TWAIFD_ID_EXT_TX    0x0003FFFFU
#define TWAIFD_ID_EXT_TX_M  (TWAIFD_ID_EXT_TX_V << TWAIFD_ID_EXT_TX_S)
#define TWAIFD_ID_EXT_TX_V  0x0003FFFFU
#define TWAIFD_ID_EXT_TX_S  0
/** TWAIFD_ID_BASE_TX : R/W; bitpos: [28:18]; default: 0;
 *  Configures the extended ID to be transmitted
 */
#define TWAIFD_ID_BASE_TX    0x000007FFU
#define TWAIFD_ID_BASE_TX_M  (TWAIFD_ID_BASE_TX_V << TWAIFD_ID_BASE_TX_S)
#define TWAIFD_ID_BASE_TX_V  0x000007FFU
#define TWAIFD_ID_BASE_TX_S  18

/** TWAIFD_TX_DATA_4_REG register
 *  TWAI FD transmit data register 4
 */
#define TWAIFD_TX_DATA_4_REG (DR_REG_TWAIFD_BASE + 0xac)
/** TWAIFD_TX_DATA0 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 0th word to be transmitted
 */
#define TWAIFD_TX_DATA0    0xFFFFFFFFU
#define TWAIFD_TX_DATA0_M  (TWAIFD_TX_DATA0_V << TWAIFD_TX_DATA0_S)
#define TWAIFD_TX_DATA0_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA0_S  0

/** TWAIFD_TX_DATA_5_REG register
 *  TWAI FD transmit data register 5
 */
#define TWAIFD_TX_DATA_5_REG (DR_REG_TWAIFD_BASE + 0xb0)
/** TWAIFD_TX_DATA1 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 1th word to be transmitted
 */
#define TWAIFD_TX_DATA1    0xFFFFFFFFU
#define TWAIFD_TX_DATA1_M  (TWAIFD_TX_DATA1_V << TWAIFD_TX_DATA1_S)
#define TWAIFD_TX_DATA1_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA1_S  0

/** TWAIFD_TX_DATA_6_REG register
 *  TWAI FD transmit data register 6
 */
#define TWAIFD_TX_DATA_6_REG (DR_REG_TWAIFD_BASE + 0xb4)
/** TWAIFD_TX_DATA2 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 2th word to be transmitted
 */
#define TWAIFD_TX_DATA2    0xFFFFFFFFU
#define TWAIFD_TX_DATA2_M  (TWAIFD_TX_DATA2_V << TWAIFD_TX_DATA2_S)
#define TWAIFD_TX_DATA2_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA2_S  0

/** TWAIFD_TX_DATA_7_REG register
 *  TWAI FD transmit data register 7
 */
#define TWAIFD_TX_DATA_7_REG (DR_REG_TWAIFD_BASE + 0xb8)
/** TWAIFD_TX_DATA3 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 3th word to be transmitted
 */
#define TWAIFD_TX_DATA3    0xFFFFFFFFU
#define TWAIFD_TX_DATA3_M  (TWAIFD_TX_DATA3_V << TWAIFD_TX_DATA3_S)
#define TWAIFD_TX_DATA3_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA3_S  0

/** TWAIFD_TX_DATA_8_REG register
 *  TWAI FD transmit data register 8
 */
#define TWAIFD_TX_DATA_8_REG (DR_REG_TWAIFD_BASE + 0xbc)
/** TWAIFD_TX_DATA4 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 4th word to be transmitted
 */
#define TWAIFD_TX_DATA4    0xFFFFFFFFU
#define TWAIFD_TX_DATA4_M  (TWAIFD_TX_DATA4_V << TWAIFD_TX_DATA4_S)
#define TWAIFD_TX_DATA4_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA4_S  0

/** TWAIFD_TX_DATA_9_REG register
 *  TWAI FD transmit data register 9
 */
#define TWAIFD_TX_DATA_9_REG (DR_REG_TWAIFD_BASE + 0xc0)
/** TWAIFD_TX_DATA5 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 5th word to be transmitted
 */
#define TWAIFD_TX_DATA5    0xFFFFFFFFU
#define TWAIFD_TX_DATA5_M  (TWAIFD_TX_DATA5_V << TWAIFD_TX_DATA5_S)
#define TWAIFD_TX_DATA5_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA5_S  0

/** TWAIFD_TX_DATA_10_REG register
 *  TWAI FD transmit data register 10
 */
#define TWAIFD_TX_DATA_10_REG (DR_REG_TWAIFD_BASE + 0xc4)
/** TWAIFD_TX_DATA6 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 6th word to be transmitted
 */
#define TWAIFD_TX_DATA6    0xFFFFFFFFU
#define TWAIFD_TX_DATA6_M  (TWAIFD_TX_DATA6_V << TWAIFD_TX_DATA6_S)
#define TWAIFD_TX_DATA6_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA6_S  0

/** TWAIFD_TX_DATA_11_REG register
 *  TWAI FD transmit data register 11
 */
#define TWAIFD_TX_DATA_11_REG (DR_REG_TWAIFD_BASE + 0xc8)
/** TWAIFD_TX_DATA7 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 7th word to be transmitted
 */
#define TWAIFD_TX_DATA7    0xFFFFFFFFU
#define TWAIFD_TX_DATA7_M  (TWAIFD_TX_DATA7_V << TWAIFD_TX_DATA7_S)
#define TWAIFD_TX_DATA7_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA7_S  0

/** TWAIFD_TX_DATA_12_REG register
 *  TWAI FD transmit data register 12
 */
#define TWAIFD_TX_DATA_12_REG (DR_REG_TWAIFD_BASE + 0xcc)
/** TWAIFD_TX_DATA8 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 8th word to be transmitted
 */
#define TWAIFD_TX_DATA8    0xFFFFFFFFU
#define TWAIFD_TX_DATA8_M  (TWAIFD_TX_DATA8_V << TWAIFD_TX_DATA8_S)
#define TWAIFD_TX_DATA8_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA8_S  0

/** TWAIFD_TX_DATA_13_REG register
 *  TWAI FD transmit data register 13
 */
#define TWAIFD_TX_DATA_13_REG (DR_REG_TWAIFD_BASE + 0xd0)
/** TWAIFD_TX_DATA9 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 9th word to be transmitted
 */
#define TWAIFD_TX_DATA9    0xFFFFFFFFU
#define TWAIFD_TX_DATA9_M  (TWAIFD_TX_DATA9_V << TWAIFD_TX_DATA9_S)
#define TWAIFD_TX_DATA9_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA9_S  0

/** TWAIFD_TX_DATA_14_REG register
 *  TWAI FD transmit data register 14
 */
#define TWAIFD_TX_DATA_14_REG (DR_REG_TWAIFD_BASE + 0xd4)
/** TWAIFD_TX_DATA10 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 10th word to be transmitted
 */
#define TWAIFD_TX_DATA10    0xFFFFFFFFU
#define TWAIFD_TX_DATA10_M  (TWAIFD_TX_DATA10_V << TWAIFD_TX_DATA10_S)
#define TWAIFD_TX_DATA10_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA10_S  0

/** TWAIFD_TX_DATA_15_REG register
 *  TWAI FD transmit data register 15
 */
#define TWAIFD_TX_DATA_15_REG (DR_REG_TWAIFD_BASE + 0xd8)
/** TWAIFD_TX_DATA11 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 11th word to be transmitted
 */
#define TWAIFD_TX_DATA11    0xFFFFFFFFU
#define TWAIFD_TX_DATA11_M  (TWAIFD_TX_DATA11_V << TWAIFD_TX_DATA11_S)
#define TWAIFD_TX_DATA11_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA11_S  0

/** TWAIFD_TX_DATA_16_REG register
 *  TWAI FD transmit data register 16
 */
#define TWAIFD_TX_DATA_16_REG (DR_REG_TWAIFD_BASE + 0xdc)
/** TWAIFD_TX_DATA12 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 12th word to be transmitted
 */
#define TWAIFD_TX_DATA12    0xFFFFFFFFU
#define TWAIFD_TX_DATA12_M  (TWAIFD_TX_DATA12_V << TWAIFD_TX_DATA12_S)
#define TWAIFD_TX_DATA12_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA12_S  0

/** TWAIFD_TX_DATA_17_REG register
 *  TWAI FD transmit data register 17
 */
#define TWAIFD_TX_DATA_17_REG (DR_REG_TWAIFD_BASE + 0xe0)
/** TWAIFD_TX_DATA13 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 13th word to be transmitted
 */
#define TWAIFD_TX_DATA13    0xFFFFFFFFU
#define TWAIFD_TX_DATA13_M  (TWAIFD_TX_DATA13_V << TWAIFD_TX_DATA13_S)
#define TWAIFD_TX_DATA13_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA13_S  0

/** TWAIFD_TX_DATA_18_REG register
 *  TWAI FD transmit data register 18
 */
#define TWAIFD_TX_DATA_18_REG (DR_REG_TWAIFD_BASE + 0xe4)
/** TWAIFD_TX_DATA14 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 14th word to be transmitted
 */
#define TWAIFD_TX_DATA14    0xFFFFFFFFU
#define TWAIFD_TX_DATA14_M  (TWAIFD_TX_DATA14_V << TWAIFD_TX_DATA14_S)
#define TWAIFD_TX_DATA14_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA14_S  0

/** TWAIFD_TX_DATA_19_REG register
 *  TWAI FD transmit data register 19
 */
#define TWAIFD_TX_DATA_19_REG (DR_REG_TWAIFD_BASE + 0xe8)
/** TWAIFD_TX_DATA15 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 15th word to be transmitted
 */
#define TWAIFD_TX_DATA15    0xFFFFFFFFU
#define TWAIFD_TX_DATA15_M  (TWAIFD_TX_DATA15_V << TWAIFD_TX_DATA15_S)
#define TWAIFD_TX_DATA15_V  0xFFFFFFFFU
#define TWAIFD_TX_DATA15_S  0

/** TWAIFD_TX_CAMMAND_INFO_REG register
 *  TWAI FD TXT buffer command & information register
 */
#define TWAIFD_TX_CAMMAND_INFO_REG (DR_REG_TWAIFD_BASE + 0x14c)
/** TWAIFD_TXTB_SW_SET_ETY : R/W; bitpos: [0]; default: 0;
 *  a\\
 */
#define TWAIFD_TXTB_SW_SET_ETY    (BIT(0))
#define TWAIFD_TXTB_SW_SET_ETY_M  (TWAIFD_TXTB_SW_SET_ETY_V << TWAIFD_TXTB_SW_SET_ETY_S)
#define TWAIFD_TXTB_SW_SET_ETY_V  0x00000001U
#define TWAIFD_TXTB_SW_SET_ETY_S  0
/** TWAIFD_TXTB_SW_SET_RDY : R/W; bitpos: [1]; default: 0;
 *  a\\
 */
#define TWAIFD_TXTB_SW_SET_RDY    (BIT(1))
#define TWAIFD_TXTB_SW_SET_RDY_M  (TWAIFD_TXTB_SW_SET_RDY_V << TWAIFD_TXTB_SW_SET_RDY_S)
#define TWAIFD_TXTB_SW_SET_RDY_V  0x00000001U
#define TWAIFD_TXTB_SW_SET_RDY_S  1
/** TWAIFD_TXTB_SW_SET_ABT : R/W; bitpos: [2]; default: 0;
 *  a\\
 */
#define TWAIFD_TXTB_SW_SET_ABT    (BIT(2))
#define TWAIFD_TXTB_SW_SET_ABT_M  (TWAIFD_TXTB_SW_SET_ABT_V << TWAIFD_TXTB_SW_SET_ABT_S)
#define TWAIFD_TXTB_SW_SET_ABT_V  0x00000001U
#define TWAIFD_TXTB_SW_SET_ABT_S  2
/** TWAIFD_TXB1 : R/W; bitpos: [8]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB1    (BIT(8))
#define TWAIFD_TXB1_M  (TWAIFD_TXB1_V << TWAIFD_TXB1_S)
#define TWAIFD_TXB1_V  0x00000001U
#define TWAIFD_TXB1_S  8
/** TWAIFD_TXB2 : R/W; bitpos: [9]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB2    (BIT(9))
#define TWAIFD_TXB2_M  (TWAIFD_TXB2_V << TWAIFD_TXB2_S)
#define TWAIFD_TXB2_V  0x00000001U
#define TWAIFD_TXB2_S  9
/** TWAIFD_TXB3 : R/W; bitpos: [10]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB3    (BIT(10))
#define TWAIFD_TXB3_M  (TWAIFD_TXB3_V << TWAIFD_TXB3_S)
#define TWAIFD_TXB3_V  0x00000001U
#define TWAIFD_TXB3_S  10
/** TWAIFD_TXB4 : R/W; bitpos: [11]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB4    (BIT(11))
#define TWAIFD_TXB4_M  (TWAIFD_TXB4_V << TWAIFD_TXB4_S)
#define TWAIFD_TXB4_V  0x00000001U
#define TWAIFD_TXB4_S  11
/** TWAIFD_TXB5 : R/W; bitpos: [12]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB5    (BIT(12))
#define TWAIFD_TXB5_M  (TWAIFD_TXB5_V << TWAIFD_TXB5_S)
#define TWAIFD_TXB5_V  0x00000001U
#define TWAIFD_TXB5_S  12
/** TWAIFD_TXB6 : R/W; bitpos: [13]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB6    (BIT(13))
#define TWAIFD_TXB6_M  (TWAIFD_TXB6_V << TWAIFD_TXB6_S)
#define TWAIFD_TXB6_V  0x00000001U
#define TWAIFD_TXB6_S  13
/** TWAIFD_TXB7 : R/W; bitpos: [14]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB7    (BIT(14))
#define TWAIFD_TXB7_M  (TWAIFD_TXB7_V << TWAIFD_TXB7_S)
#define TWAIFD_TXB7_V  0x00000001U
#define TWAIFD_TXB7_S  14
/** TWAIFD_TXB8 : R/W; bitpos: [15]; default: 0;
 *  a\\
 */
#define TWAIFD_TXB8    (BIT(15))
#define TWAIFD_TXB8_M  (TWAIFD_TXB8_V << TWAIFD_TXB8_S)
#define TWAIFD_TXB8_V  0x00000001U
#define TWAIFD_TXB8_S  15
/** TWAIFD_TXT_BUF_CTR : R/W; bitpos: [19:16]; default: 0;
 *  a\\
 */
#define TWAIFD_TXT_BUF_CTR    0x0000000FU
#define TWAIFD_TXT_BUF_CTR_M  (TWAIFD_TXT_BUF_CTR_V << TWAIFD_TXT_BUF_CTR_S)
#define TWAIFD_TXT_BUF_CTR_V  0x0000000FU
#define TWAIFD_TXT_BUF_CTR_S  16

/** TWAIFD_ERR_CAP_RETR_CTR_ALC_REG register
 *  TWAI FD error capture & retransmit counter & arbitration lost register
 */
#define TWAIFD_ERR_CAP_RETR_CTR_ALC_REG (DR_REG_TWAIFD_BASE + 0x160)
/** TWAIFD_ERR_TYPE : RO; bitpos: [4:0]; default: 0;
 *  a\\
 */
#define TWAIFD_ERR_TYPE    0x0000001FU
#define TWAIFD_ERR_TYPE_M  (TWAIFD_ERR_TYPE_V << TWAIFD_ERR_TYPE_S)
#define TWAIFD_ERR_TYPE_V  0x0000001FU
#define TWAIFD_ERR_TYPE_S  0
/** TWAIFD_ERR_POS : RO; bitpos: [7:5]; default: 0;
 *  a\\
 */
#define TWAIFD_ERR_POS    0x00000007U
#define TWAIFD_ERR_POS_M  (TWAIFD_ERR_POS_V << TWAIFD_ERR_POS_S)
#define TWAIFD_ERR_POS_V  0x00000007U
#define TWAIFD_ERR_POS_S  5
/** TWAIFD_RETR_CTR : RO; bitpos: [11:8]; default: 0;
 *  a\\
 */
#define TWAIFD_RETR_CTR    0x0000000FU
#define TWAIFD_RETR_CTR_M  (TWAIFD_RETR_CTR_V << TWAIFD_RETR_CTR_S)
#define TWAIFD_RETR_CTR_V  0x0000000FU
#define TWAIFD_RETR_CTR_S  8
/** TWAIFD_ALC_BIT : RO; bitpos: [20:16]; default: 0;
 *  a\\
 */
#define TWAIFD_ALC_BIT    0x0000001FU
#define TWAIFD_ALC_BIT_M  (TWAIFD_ALC_BIT_V << TWAIFD_ALC_BIT_S)
#define TWAIFD_ALC_BIT_V  0x0000001FU
#define TWAIFD_ALC_BIT_S  16
/** TWAIFD_ALC_ID_FIELD : RO; bitpos: [23:21]; default: 0;
 *  a\\
 */
#define TWAIFD_ALC_ID_FIELD    0x00000007U
#define TWAIFD_ALC_ID_FIELD_M  (TWAIFD_ALC_ID_FIELD_V << TWAIFD_ALC_ID_FIELD_S)
#define TWAIFD_ALC_ID_FIELD_V  0x00000007U
#define TWAIFD_ALC_ID_FIELD_S  21

/** TWAIFD_TRV_DELAY_SSP_CFG_REG register
 *  TWAI FD transmit delay & secondary sample point configuration register
 */
#define TWAIFD_TRV_DELAY_SSP_CFG_REG (DR_REG_TWAIFD_BASE + 0x164)
/** TWAIFD_TRV_DELAY_VALUE : RO; bitpos: [6:0]; default: 0;
 *  a\\
 */
#define TWAIFD_TRV_DELAY_VALUE    0x0000007FU
#define TWAIFD_TRV_DELAY_VALUE_M  (TWAIFD_TRV_DELAY_VALUE_V << TWAIFD_TRV_DELAY_VALUE_S)
#define TWAIFD_TRV_DELAY_VALUE_V  0x0000007FU
#define TWAIFD_TRV_DELAY_VALUE_S  0
/** TWAIFD_SSP_OFFSET : R/W; bitpos: [23:16]; default: 10;
 *  a\\
 */
#define TWAIFD_SSP_OFFSET    0x000000FFU
#define TWAIFD_SSP_OFFSET_M  (TWAIFD_SSP_OFFSET_V << TWAIFD_SSP_OFFSET_S)
#define TWAIFD_SSP_OFFSET_V  0x000000FFU
#define TWAIFD_SSP_OFFSET_S  16
/** TWAIFD_SSP_SRC : R/W; bitpos: [25:24]; default: 0;
 *  a\\
 */
#define TWAIFD_SSP_SRC    0x00000003U
#define TWAIFD_SSP_SRC_M  (TWAIFD_SSP_SRC_V << TWAIFD_SSP_SRC_S)
#define TWAIFD_SSP_SRC_V  0x00000003U
#define TWAIFD_SSP_SRC_S  24

/** TWAIFD_RX_FRM_COUNTER_REG register
 *  TWAI FD received frame counter register
 */
#define TWAIFD_RX_FRM_COUNTER_REG (DR_REG_TWAIFD_BASE + 0x180)
/** TWAIFD_RX_COUNTER_VAL : RO; bitpos: [31:0]; default: 0;
 *  Configures the received frame counters to enable bus traffic measurement.
 */
#define TWAIFD_RX_COUNTER_VAL    0xFFFFFFFFU
#define TWAIFD_RX_COUNTER_VAL_M  (TWAIFD_RX_COUNTER_VAL_V << TWAIFD_RX_COUNTER_VAL_S)
#define TWAIFD_RX_COUNTER_VAL_V  0xFFFFFFFFU
#define TWAIFD_RX_COUNTER_VAL_S  0

/** TWAIFD_TX_FRM_COUNTER_REG register
 *  TWAI FD transmitted frame counter register
 */
#define TWAIFD_TX_FRM_COUNTER_REG (DR_REG_TWAIFD_BASE + 0x184)
/** TWAIFD_TX_COUNTER_VAL : RO; bitpos: [31:0]; default: 0;
 *  Configures the transcieved frame counters to enable bus traffic measurement.
 */
#define TWAIFD_TX_COUNTER_VAL    0xFFFFFFFFU
#define TWAIFD_TX_COUNTER_VAL_M  (TWAIFD_TX_COUNTER_VAL_V << TWAIFD_TX_COUNTER_VAL_S)
#define TWAIFD_TX_COUNTER_VAL_V  0xFFFFFFFFU
#define TWAIFD_TX_COUNTER_VAL_S  0

/** TWAIFD_CLK_REG register
 *  TWAI FD clock configuration register
 */
#define TWAIFD_CLK_REG (DR_REG_TWAIFD_BASE + 0x18c)
/** TWAIFD_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  1'b1: Force clock on for register. 1'b0: Support clock only when application writes
 *  registers.
 */
#define TWAIFD_CLK_EN    (BIT(31))
#define TWAIFD_CLK_EN_M  (TWAIFD_CLK_EN_V << TWAIFD_CLK_EN_S)
#define TWAIFD_CLK_EN_V  0x00000001U
#define TWAIFD_CLK_EN_S  31

/** TWAIFD_DATE_REG register
 *  TWAI FD version register
 */
#define TWAIFD_DATE_REG (DR_REG_TWAIFD_BASE + 0x190)
/** TWAIFD_TWAIFD_DATE : R/W; bitpos: [31:0]; default: 35717712;
 *  This is the version register.
 */
#define TWAIFD_TWAIFD_DATE    0xFFFFFFFFU
#define TWAIFD_TWAIFD_DATE_M  (TWAIFD_TWAIFD_DATE_V << TWAIFD_TWAIFD_DATE_S)
#define TWAIFD_TWAIFD_DATE_V  0xFFFFFFFFU
#define TWAIFD_TWAIFD_DATE_S  0

#ifdef __cplusplus
}
#endif
